[{"rank":100,"name":"Borderlands 2","slug":"borderlands-2","beatInfo":{"main":30,"mainExtra":54,"completionist":127},"imageUrl":"/games/Borderlands2boxart3.jpg","summary":"Borderlands 2 is a 2012 first-person shooter video game developed by Gearbox Software and published by 2K Games. Taking place five years following the events of Borderlands (2009), the game is once again set on the planet of Pandora. The story follows a new group of Vault Hunters who must ally with the Crimson Raiders, a resistance group made up of civilian survivors and guerrilla fighters, to defeat the tyrannical Handsome Jack before he can unlock the power of a new Vault. The game features the ability to explore the in-game world and complete both main missions and optional side quests, either in offline splitscreen, single-player or online cooperative gameplay. Like its predecessor, the game features a procedurally generated loot system which is capable of generating numerous combinations of weapons and other gear.\nWith the unexpected success of the first game, Gearbox was able to secure a budget of $30–35 million to develop the sequel. Like its predecessor, the game adopted the \"concept art style\", which features graphics inspired by both photorealistic imagery and comic-book-inspired visuals. The team attempted to address players' feedback from the first game, and recruited Anthony Burch who wrote the game's script which is seven times longer than that of the original game. Among the game's diverse cast of characters, Handsome Jack, the central antagonist, was created to be a charismatic \"douche\" that mirrors Burch's own personality. Borderlands 2 was released for Microsoft Windows, PlayStation 3 and Xbox 360 in September 2012, and it was ported to PlayStation 4 and Xbox One as part of The Handsome Collection in March 2015.\nThe game received universal acclaim upon release. Critics generally praised the game's visuals, story, writing, gameplay, and online multiplayer, as well as its variety of guns, while criticising its mission design and content fillers. The handheld and the virtual reality versions of the game were regarded to be inferior to the console and PC versions. More than 20 million units were shipped upon release and the game became 2K's most successful release. It was nominated for multiple year-end accolades by several gaming publications. Gearbox supported the game with four add-on campaigns, new characters and five content packs. The game was followed by Borderlands: The Pre-Sequel in October 2014, and Borderlands 3 in September 2019."},{"rank":99,"name":"Divinity: Original Sin 2","slug":"divinity-original-sin-2","beatInfo":{"main":59,"mainExtra":98.5,"completionist":151},"imageUrl":"/games/39525_Divinity_Original_Sin_2.jpg","summary":"Divinity: Original Sin II is a role-playing video game developed and published by Larian Studios. The sequel to 2014's Divinity: Original Sin, it was released for Microsoft Windows in September 2017, for PlayStation 4 and Xbox One in August 2018, for macOS in January 2019, Nintendo Switch in September 2019, and iPadOS in May 2021. The game was a critical and commercial success, with it selling over a million copies in two months and being cited as one of the best role-playing games of all time, with praise given to its combat complexity and interactivity."},{"rank":98,"name":"Final Fantasy VII","slug":"final-fantasy-vii","beatInfo":{"main":36.5,"mainExtra":50.5,"completionist":82.5},"imageUrl":"/games/Ffviibox.jpg","summary":"Final Fantasy VII is a 1997 role-playing video game developed by Square for the PlayStation console. It is the seventh main installment in the Final Fantasy series. Published in Japan by Square, it was released in other regions by Sony Computer Entertainment and is the first in the main series with a PAL release. The game's story follows Cloud Strife, a mercenary who joins an eco-terrorist organization to stop a world-controlling megacorporation from using the planet's life essence as an energy source. Events send Cloud and his allies in pursuit of Sephiroth, a former member of the corporation who seeks to destroy the planet. During the journey, Cloud builds close friendships with his party members, including Aerith Gainsborough, who holds the secret to saving their world.\nDevelopment began in 1994, originally for the  Super Famicom. After delays and technical difficulties from experimenting on several real-time rendering platforms, Square moved production to pre-rendered video, necessitating the huge capacity of the CD-ROM format and therefore departing Nintendo for the PlayStation. Veteran Final Fantasy staff returned, including series creator and producer Hironobu Sakaguchi, director Yoshinori Kitase, and composer Nobuo Uematsu. The game is the first in the series to use full motion video and 3D computer graphics, superimposing real-time 3D character models over pre-rendered CGI backgrounds. Final Fantasy VII introduced more widespread science fiction elements and a more realistic presentation, while the gameplay systems remained largely similar to previous entries, with the addition of new elements such as Materia, Limit Breaks, and new minigames. The staff of more than 100 had a combined development and marketing budget of around $80 million.\nAssisted by a large promotional campaign, Final Fantasy VII was a commercial success and received universal acclaim, selling more than 13.3 million copies worldwide. It is regarded as a landmark game and as one of the greatest and most influential video games ever made. It won numerous Game of the Year awards, and was acknowledged for boosting sales of the PlayStation and popularizing console role-playing games worldwide. Critics praised its graphics, gameplay, music, and story, although its original English localization received criticism. Its success has led to enhanced ports on various platforms, a multimedia sub-series called the Compilation of Final Fantasy VII, and the ongoing multipart high-definition Final Fantasy VII Remake, the first installment of which was released in 2020."},{"rank":97,"name":"Assassin's Creed IV: Black Flag","slug":"assassins-creed-iv-black-flag","beatInfo":{"main":23,"mainExtra":41,"completionist":60},"imageUrl":"/games/Assassins_Creed_IV_-_Black_Flag_cover.jpg","summary":"Assassin's Creed IV: Black Flag is a 2013 action-adventure video game developed by Ubisoft Montreal and published by Ubisoft. It is the sixth major installment in the Assassin's Creed series. Its historical timeframe precedes that of Assassin's Creed III (2012), but its modern-day sequences succeed III's own. Black Flag was originally released for PlayStation 3, Xbox 360, and Wii U in October 2013 and a month later for PlayStation 4, Xbox One, and Microsoft Windows. It was later re-released on the Nintendo Switch as part of The Rebel Collection alongside Assassin's Creed Rogue in December 2019. The game was released for Google Stadia in September 2021.\nThe plot is set in a fictional history of real-world events and follows the millennia-old struggle between the Assassins, who fight to preserve peace and free will, and the Templars, who desire peace through control. The framing story is set in the 21st century and depicts the player as an employee of Abstergo Industries (a company used as a front by the modern-day Templars), who is manipulated into uncovering secrets related to the Assassin-Templar conflict and the precursor race known as the First Civilization. The main story is set in the West Indies during the Golden Age of Piracy from 1715 to 1722, and follows notorious Welsh pirate Edward Kenway, grandfather and father of Assassin's Creed III protagonist Ratonhnhaké:ton / Connor and antagonist Haytham Kenway, respectively, as he searches for fortune and a mythical location called the Observatory, which is sought by both the Assassins and the Templars. A major plot element concerns the attempted establishment of an independent Pirate republic in the Caribbean.\nUnlike previous games, gameplay elements focus more on the ship-based exploration of the seamless open world map, while also retaining the series' third-person land-based exploration, melee combat, and stealth system. Multiplayer also returns, albeit with only land-based modes and settings. The game's setting spans the West Indies with the three main cities of Havana, Nassau, and Kingston, along with numerous islands, sunken ships, and forts. Players have the option to harpoon large sea animals and hunt land animals. For the first time in the series, naval exploration is a major part of an Assassin's Creed game, where Edward captains the Jackdaw, a brig he captures from a Spanish fleet in an early game mission. A number of downloadable content (DLC) packs were released to support Black Flag, including Assassin's Creed Freedom Cry, a story expansion that was later made available as a standalone game in 2014. Set over a decade after Black Flag's main campaign, Freedom Cry follows Adéwalé, Edward's former quartermaster who became an Assassin.\nAssassin's Creed IV: Black Flag received critical acclaim and was one of the best-selling games of 2013, with over 15 million copies sold as of 2020. Critics praised the open world gameplay, improved naval combat, side-quests, graphics, narrative, characters, and pirate theme. However, the modern-day story and combat received a slightly more mixed response, while criticism fell on aspects of the historical story missions which were considered repetitive. The game received several awards and nominations, including winning the Spike VGX 2013 award for Best Action Adventure Game. It was followed by Assassin's Creed Rogue and Assassin's Creed Unity in November 2014."},{"rank":96,"name":"Monkey Island 2: LeChuck's Revenge","slug":"monkey-island-2-lechucks-revenge","beatInfo":{"main":7,"mainExtra":7.5,"completionist":7.5},"imageUrl":"/games/250px-LeChucks_Revenge_artwork.jpg","summary":"Monkey Island 2: LeChuck's Revenge is an adventure game developed and published by LucasArts in 1991. A sequel to 1990's The Secret of Monkey Island, it is the second game in the Monkey Island series. It was the sixth LucasArts game to use the SCUMM engine, and the first game to use the iMUSE sound system. In it, pirate Guybrush Threepwood searches for the legendary treasure of Big Whoop and again faces off against the pirate LeChuck, who is now a zombie.\nThe development team for Monkey Island 2 was largely the same as for The Secret of Monkey Island. The project was led by Ron Gilbert, who was again joined by Tim Schafer and Dave Grossman. The game was a critical success, but a commercial disappointment. Further sequels were developed by other creative teams, who had to deal with the game's ambiguous ending on their own. A \"Special Edition\" remake of Monkey Island 2 was released in 2010, following a similar remake of the first game. Return to Monkey Island, which takes place immediately after Monkey Island 2 and is helmed by Gilbert, is planned to be released in 2022."},{"rank":95,"name":"Burnout 3: Takedown","slug":"burnout-3-takedown","beatInfo":{"main":14,"mainExtra":22,"completionist":33.5},"imageUrl":"/games/256px-Burnout_3_-_Takedown_Coverart.jpg","summary":"Burnout 3: Takedown is a 2004 racing video game developed by Criterion Games and published by Electronic Arts. It is the third instalment in the Burnout series, which is characterised by fast-paced arcade racing. A staple of the series is the use of boost, earned through risky driving, to rapidly increase a car's speed. The central mechanic introduced in Burnout 3 is Takedowns, which allow players to slam their opponents until they crash. Takedowns work in conjunction with the boost system by filling up and extending the boost meter. Aside from standard circuit races, the game features modes focused on performing Takedowns on rival vehicles and causing monetary damage at a junction occupied with traffic. Each game variant is featured in a single-player campaign mode called World Tour, which serves as the primary method for unlocking new and faster cars. The game supports both online and split-screen multiplayer.\nBefore the creation of Burnout 3: Takedown, UK-based development studio Criterion had been collaborating with publisher Electronic Arts (EA) on a skating video game. However, disagreements over the game's creative direction led to its cancellation and falling out between the two companies. EA later approached Criterion about reuniting and partnering on a game, and so Criterion began developing Burnout 3: Takedown in June 2003 on the condition that EA would not interfere in the creative process. Over a year later, EA acquired Criterion and the Burnout series; their high expectations for Burnout 3: Takedown was influential in the acquisition. The game launched in September 2004 on the PlayStation 2 and Xbox video game consoles.\nUpon release, Burnout 3: Takedown received critical acclaim from the video game press becoming one of the highest-rated racing video games of all time and is considered by many to be one of the greatest video games of all time. Critics were enthused by the shift to a more aggressive style of racing game and the addition of gameplay mechanics like Takedowns. The addictive gameplay and visuals were widely praised by reviewers, many of whom ranked Burnout 3: Takedown among the best games released on the PlayStation 2 and Xbox. The game went on to win numerous awards including three from the British Academy Games Awards. Retrospective coverage of the game has been highly positive with some publications declaring it as the greatest arcade racer game ever made and the peak of the Burnout series. A successor to Takedown, titled Burnout Revenge, was released in September 2005."},{"rank":94,"name":"Fallout 2","slug":"fallout-2","beatInfo":{"main":30.5,"mainExtra":47,"completionist":83.5},"imageUrl":"/games/250px-PC_Game_Fallout_2.jpg","summary":"Fallout 2 is a 1998 role-playing video game developed by Black Isle Studios and published by Interplay Productions. A sequel to Fallout, which had been released the previous year, it mostly uses similar graphics and game mechanics. Fallout 2 featured a considerably larger game world and a far more extensive storyline. It was originally released on Windows and ported to Mac OS X in 2002.\nThe game's story takes place in 2241, 80 years after the events of Fallout (the first and original installment of the Fallout series) and 164 years after the atomic war which reduced the vast majority of the world to a nuclear wasteland. The plot tells the story of The Chosen One, the grandchild of the Vault Dweller, and their quest to save their primitive, peaceful tribe from the small village of Arroyo, situated on the West Coast of the United States and founded by a wretched group of former residents from Vault 13 led by the Vault Dweller, from starvation by finding an ancient environmental restoration machine known as the Garden of Eden Creation Kit (GECK) in the ruins of the tribe's ancestral home. Upon completing the mission, however, The Chosen One discovers that their tribe has been conquered by the \"Enclave\", a group of marauders claiming to wield the authority of the former U.S. federal government, and must fight to save their people from enslavement and death.\nIn terms of critical acclaim, the game was well-received as well as tremendously praised for its gameplay, storyline, and as a worthy successor to the original Fallout, while the frequent bugs and lack of improvement over the first game attracted mild criticism on behalf of several gamer groups and gaming magazines. The game was followed by Fallout 3 in 2008, developed by Bethesda Game Studios after Bethesda acquired the rights to the franchise from Interplay Productions."},{"rank":93,"name":"League of Legends","slug":"league-of-legends","beatInfo":{"main":1504,"mainExtra":1273,"completionist":1353},"imageUrl":"/games/5203_League_of_Legends.jpg","summary":"League of Legends (LoL), commonly referred to as League, is a 2009 multiplayer online battle arena video game developed and published by Riot Games. Inspired by Defense of the Ancients, a custom map for Warcraft III, Riot's founders sought to develop a stand-alone game in the same genre. Since its release in October 2009, League has been free-to-play and is monetized through purchasable character customization. The game is available for Microsoft Windows and macOS.\nIn the game, two teams of five players battle in player-versus-player combat, each team occupying and defending their half of the map. Each of the ten players controls a character, known as a \"champion\", with unique abilities and differing styles of play. During a match, champions become more powerful by collecting experience points, earning gold, and purchasing items to defeat the opposing team. In League's main mode, Summoner's Rift, a team wins by pushing through to the enemy base and destroying their \"Nexus\", a large structure located within.\nLeague of Legends has received generally positive reviews; critics highlighted its accessibility, character designs, and production value. The game's long lifespan has resulted in a critical reappraisal, with reviews trending positively; the negative and abusive in-game behavior of its players, criticized since early in the game's lifetime, persists despite Riot's attempts to fix the problem. In 2019, League regularly peaked at eight million concurrent players, and its popularity has led to tie-ins such as music videos, comic books, short stories, and an animated series, Arcane. Its success has also spawned several spin-off video games, including a mobile version, a digital collectible card game and a turn-based role-playing game, among others. A massively multiplayer online role-playing game based on the property is in development.\nRegularly cited as the world's largest esport, the game has an international competitive scene consisting of 12 leagues. These domestic leagues culminate in the annual League of Legends World Championship. The 2019 event registered over 100 million unique viewers, peaking at a concurrent viewership of 44 million during the finals. Domestic and international events have been broadcast on livestreaming websites such as Twitch, YouTube, Bilibili, and on cable television sports channel ESPN."},{"rank":92,"name":"Mega Man 3","slug":"mega-man-3","beatInfo":{"main":3.5,"mainExtra":4,"completionist":4},"imageUrl":"/games/200px-Megaman3_box.jpg","summary":"Mega Man 3 is an action-platform video game developed and published by Capcom for the Nintendo Entertainment System. It is the third game of the original Mega Man series and was originally released in Japan on September 28, 1990. The game localized in North America later in 1990 and in European regions in 1992. Taking place after the events of Mega Man 2, the plot follows the titular hero as he helps his creator, Dr. Light, and a former villain, Dr. Wily, collect parts for a peace-keeping robot by defeating several Robot Masters that have gone haywire.\nA platform-action game, Mega Man 3 follows the same format set forth by its two predecessors. The player, as Mega Man, must complete a series of stages in any order. Defeating a stage's boss will earn the player its special weapon, which can be selected and used at will throughout the rest of the game. Mega Man 3 introduces new gameplay elements such as Mega Man's canine sidekick Rush and the ability to slide along the ground. Unlike with the first two installments of the series, artist and designer Keiji Inafune has considered the creation of Mega Man 3 to be very stressful due to time constraints and his own increased responsibilities during its development.\nFollowing the success of Mega Man 2 released two years earlier, Mega Man 3 has sold 1.17 million copies and has been positively received in critical reviews. Its presentation and gameplay has been especially praised, although many sources found the game to be too difficult. Like other titles in the series, Mega Man 3 has been re-released several times on other gaming platforms, on mobile phones, and as part of various Mega Man franchise compilations. A sequel, Mega Man 4, was released in 1991."},{"rank":91,"name":"Animal Crossing: New Horizons","slug":"animal-crossing-new-horizons","beatInfo":{"main":60.5,"mainExtra":140,"completionist":352},"imageUrl":"/games/68240_Animal_Crossing_New_Horizons.jpg","summary":"Animal Crossing: New Horizons is a 2020 social simulation game developed and published by Nintendo for the Nintendo Switch; it is the fifth main entry in the Animal Crossing series. In New Horizons, the player controls a character who moves to a deserted island after purchasing a getaway package from Tom Nook, accomplishes assigned tasks, and develops the island as they choose. They can gather and craft items, customize the island, and develop it into a community of anthropomorphic animals.\nNew Horizons began its development in 2012. The game director, Aya Kyogoku, retained old content from previous games to keep fans happy and also ensured that the game was simple enough to appeal to newcomers. With art and graphics, the developers used the concept of \"trigger of play\" and the \"imagination gap\", where the former kept the gameplay simplistic and easy to pick up while the latter kept the art style simple for the player to imagine the rest. The game was announced at E3 2019 via a Nintendo Direct and after an extended development period, released worldwide March 20, 2020.\nNew Horizons received acclaim from critics, who praised its gameplay and customization options and called it the best game in the Animal Crossing series. The game was nominated for over a dozen awards and was a contender for Game of the Year. It was a major commercial success, selling over 38.64 million copies worldwide and breaking the console game record for most digital units sold in a single month. It is the best-selling game in the Animal Crossing series, the second best-selling game on the Nintendo Switch, the best-selling game of all time in Japan, and the 15th best-selling video game in history. Its commercial success has been attributed in part to its release amid global stay-at-home orders during the COVID-19 pandemic. The game has been used as a substitute for social interactions such as weddings and graduation ceremonies, as well as political campaigning and virtual protests. The game also inspired fan creations, such as a trading website, a talk show, and other comics and merchandise. It also received major updates adding new content until November 5, 2021."},{"rank":90,"name":"Thief II: The Metal Age","slug":"thief-ii-the-metal-age","beatInfo":{"main":20.5,"mainExtra":27,"completionist":36.5},"imageUrl":"/games/Thief_II_-_The_Metal_Age_Coverart.png","summary":"Thief II: The Metal Age is a 2000 stealth video game developed by Looking Glass Studios and published by Eidos Interactive. Like its predecessor Thief: The Dark Project, the game follows Garrett, a master thief who works in and around a steampunk metropolis called the City. The player assumes the role of Garrett as he unravels a conspiracy related to a new religious sect. Garrett takes on missions such as burglaries and frameups, while trying to avoid detection by guards and automated security.\nThief II was designed to build on the foundation of its predecessor. In response to feedback from players of Thief, the team placed a heavy focus on urban stealth in the sequel, and they minimized the use of monsters and maze-like levels. The game was made with the third iteration of the Dark Engine, which had been used previously to develop Thief and System Shock 2. Thief II was announced at the 1999 Electronic Entertainment Expo, as part of an extended contract between Looking Glass and Eidos to release games in the Thief series. Looking Glass neared bankruptcy as the game was developed, and the company was kept running by advances from Eidos.\nThief II received positive reviews from critics, and its initial sales were stronger than those of its predecessor. However, the game's royalties were processed slowly, which compounded Looking Glass's financial troubles. As a result, the company closed in May 2000, with plans for Thief III cancelled. The third game in the series, entitled Thief: Deadly Shadows, was developed by Ion Storm and published by Eidos in 2004. Thief 2X: Shadows of the Metal Age, a widely praised expansion mod for Thief II, was released in 2005. In 2014, Square Enix published a reboot of the series, developed by Eidos Montréal."},{"rank":89,"name":"SimCity 2000","slug":"simcity-2000","beatInfo":{"main":23,"mainExtra":26,"completionist":94},"imageUrl":"/games/SimCity_2000_Coverart.png","summary":"SimCity 2000 is a city-building simulation video game jointly developed by Will Wright and Fred Haslam of Maxis. It is the successor to SimCity Classic and was released for Apple Macintosh personal computers in 1993, after which it was released on other platforms over the following years, such as the Sega Saturn and SNES game consoles in 1995 and the PlayStation in 1996.SimCity 2000 is played from an isometric perspective as opposed to the previous title, which was played from a top-down perspective. The objective of the game is to create a city, develop residential and industrial areas, build infrastructure and collect taxes for further development of the city. Importance is put on increasing the standard of living of the population, maintaining a balance between the different sectors, and monitoring the region's environmental situation to prevent the settlement from declining and going bankrupt, as extreme deficit spending gets a game over.SimCity 2000 was critically praised for its vibrant and detailed graphics, improved control menu, gameplay and music. An approximate total of 4.23 million copies of SimCity 2000 have been sold, mainly in the United States, Europe and Japan. While its predecessor pioneered the city-building genre of video games, SimCity 2000 would become the model upon which subsequent urban simulators would be based over the course of the next decades."},{"rank":88,"name":"Inside","slug":"inside","beatInfo":{"main":3.5,"mainExtra":4,"completionist":4.5},"imageUrl":"/games/INSIDE_banner.jpg","summary":"Inside may refer to:\n\nInsider, a member of any group of people of limited number and generally restricted access\n\n"},{"rank":87,"name":"Titanfall 2","slug":"titanfall-2","beatInfo":{"main":6,"mainExtra":8,"completionist":15},"imageUrl":"/games/38000_Titanfall_2.jpg","summary":"Titanfall 2 is a first-person shooter video game, developed by Respawn Entertainment and published by Electronic Arts. A sequel to 2014's Titanfall, the game was released worldwide on October 28, 2016, for Windows, PlayStation 4, and Xbox One. In Titanfall 2, players control Titans, mecha-style exoskeletons and their pilots, who are agile and equipped with a variety of skills ranging from wall-running to cloaking. Set in a science fiction universe, the single-player campaign follows the story of Jack Cooper, a rifleman from the Frontier Militia, who bonds with his mentor's Titan BT-7274 after his mentor is killed in action. Together, they embark on a quest to stop the Interstellar Manufacturing Corporation (IMC) from launching a superweapon that is threatening to destroy the Militia planet Harmony.\nThe game's two-year development cycle began in mid-2014. The decision to add a single-player campaign to the game came about because the team wanted to expand the game's player base. They came up with different ideas and prototypes, and integrated them to form a single coherent campaign. Gargantia on the Verdurous Planet and buddy cop films, as well as the video game Half-Life inspired the game's campaign and narrative. The team also overhauled the progression system and made subtle changes to the multiplayer to make the gameplay more fair. A heavily modified version of Valve's Source engine powers the game. Stephen Barton returned to compose the game's music.\nUpon release, the game received critical acclaim. The single-player campaign was praised for its design and execution, and the multiplayer modes for building on the foundation of the original game. Despite the positive reception, Titanfall 2 underperformed commercially, with most attributing its underwhelming performance to going on sale in a crowded release window, placed between the release of Battlefield 1 and Call of Duty: Infinite Warfare. It was nominated for multiple year-end accolades, including Game of the Year and Best Shooter awards, by several gaming publications. Respawn continued to support the game after its release, providing several updates and downloadable content."},{"rank":86,"name":"Tony Hawk's Pro Skater 2","slug":"tony-hawks-pro-skater-2","beatInfo":{"main":9,"mainExtra":13,"completionist":62},"imageUrl":"/games/250px-TonyHawksProSkater2Nintendo64.jpg","summary":"Tony Hawk's Pro Skater 2 is a skateboarding video game developed by Neversoft and published by Activision. It is the second installment in the Tony Hawk's series of sports games and was released for the PlayStation in 2000, with subsequent ports to Microsoft Windows, Game Boy Color, and Dreamcast the same year. In 2001, the game was ported to the Mac OS, Game Boy Advance, Nintendo 64, and Xbox (as part of Tony Hawk's Pro Skater 2x). The game was later ported to Windows Mobile and Windows Phone devices in 2006 and to iOS devices in 2010.\nTony Hawk's Pro Skater 2 uses the same game engine as its predecessor while improving the graphics and gameplay, most notably with the introduction of manuals and cash rewards. The game takes place in a three-dimensional urban environment permeated by an ambience of punk rock and hip hop music. The player takes control of a variety of skateboarders and either performs skateboarding tricks or collects certain objects. The game offers several modes of gameplay, including a career mode in which the player must complete objectives and evolve their character's attributes with earned profits, a free-play mode in which the player may skate without any given objective, a multiplayer mode that features a number of competitive games, and a level editor that allows the player to create customized levels.\nTony Hawk's Pro Skater 2 was critically acclaimed upon release and is considered one of the greatest video games of all time, as well as the highest-rated sports video game. All versions of the game were praised, including its addictive gameplay, large environments, detailed graphics, fluid and precise controls, customization features and soundtrack, with some minor criticisms directed at the lack of a first-person camera and the truncated soundtrack of the Nintendo 64 version."},{"rank":85,"name":"Monster Hunter: World","slug":"monster-hunter-world","beatInfo":{"main":47.5,"mainExtra":105,"completionist":380},"imageUrl":"/games/52493_Monster_Hunter_World.jpg","summary":"Monster Hunter: World is an action role-playing game developed and published by Capcom and the fifth mainline installment in the Monster Hunter series. It was released worldwide for PlayStation 4 and Xbox One in January 2018, with a Microsoft Windows version following in August 2018. In the game, the player takes the role of a Hunter, tasked to hunt down and either kill or trap monsters that roam in one of several environmental spaces. If successful, the player is rewarded through loot consisting of parts from the monster and other elements that are used to craft weapons and armor, amongst other equipment. The game's core loop has the player crafting appropriate gear to be able to hunt down more difficult monsters, which in turn provide parts that lead to more powerful gear. Players may hunt alone or in a group of up to four players via the game's online multiplayer.\nAnnounced at E3 2017, Monster Hunter: World adopts the series' standard formulas from its older home console roots and recent handheld games to take advantage of the higher processing power provided by modern consoles and computers. Changes made in Monster Hunter: World include creating environmental spaces that are fully connected and removing the \"zones\" that were necessary for the PlayStation 2 and handheld games, more advanced monster artificial intelligence and physics, a more persistent cooperative multiplayer experience, and a refinement of the game's tutorials and user interface to help with bringing new players into the series. These changes led Capcom to plan for the game's simultaneous release worldwide, since Monster Hunter as a series has generally languished outside of Japan partially due to disparate release schedules. Capcom also opted to support online play between these different geographic regions for similar reasons. The delay for the Windows release was attributed to Capcom seeking to make sure its first foray into the Windows market was optimized for players on computers. By April 2020, updates to the game were synchronized among all platforms.\nMonster Hunter: World received critical acclaim upon release, with critics praising how Capcom was able to make the game more accessible to new players and to Western markets, without detracting from the series' core gameplay elements and enjoyable difficulty, and fully taking advantage of the computational capacity of modern consoles to create living ecosystems, with some even calling it the best in the franchise. Monster Hunter: World is the single highest-selling game in Capcom's history, with over 21 million copies shipped by July 2022. A DLC expansion pack, subtitled Iceborne, was released for home consoles in September 2019 and for Windows in January 2020, and reached over 9.2 million sales by May 2022. The next mainline installment, Monster Hunter Rise, was co-developed alongside World and announced for a worldwide release on Nintendo Switch in March 2021, with a Microsoft Windows version released the following year."},{"rank":84,"name":"Resident Evil 2 (Remake)","slug":"resident-evil-2-remake","beatInfo":{"main":0,"mainExtra":0,"completionist":0},"imageUrl":"","summary":"Resident Evil 2 is a 1998 survival horror video game developed and published by Capcom for the PlayStation. The player controls Leon S. Kennedy and Claire Redfield, who must escape Raccoon City after its citizens are transformed into zombies by a biological weapon two months after the events of the original Resident Evil. The gameplay focuses on exploration, puzzles, and combat; the main difference from its predecessor are the branching paths, with each player character having unique storylines, partners and obstacles.\nResident Evil 2 was produced by Resident Evil director Shinji Mikami, directed by Hideki Kamiya, and developed by a team of approximately 50 across 21 months. The initial version, commonly referred to as Resident Evil 1.5, differs drastically; it was canceled at approximately two thirds completion because Mikami decided it was inadequate. The final design introduced a more cinematic presentation.\nResident Evil 2 received acclaim for its atmosphere, setting, graphics, audio, scenarios, overall gameplay, and its improvements over the original game, but with some criticism towards its controls, voice acting, and certain gameplay elements. It is widely listed among the best video games ever made. It is the best-selling Resident Evil game for a single platform at more than 6 million copies sold across all platforms. It was ported to Windows, Nintendo 64, Dreamcast, and GameCube, and a modified 2.5D version was released for the Game.com handheld. The story of Resident Evil 2 was retold and built upon in several later games, and has been adapted into a variety of licensed works. It was followed by Resident Evil 3: Nemesis in 1999. A remake was released for PlayStation 4, Xbox One, and Windows in 2019."},{"rank":83,"name":"System Shock 2","slug":"system-shock-2","beatInfo":{"main":13.5,"mainExtra":17.5,"completionist":22},"imageUrl":"/games/Systemshock2box.jpg","summary":"System Shock 2 is a 1999 action role-playing survival horror video game designed by Ken Levine and co-developed by Irrational Games and Looking Glass Studios. Originally intended to be a standalone title, its story was changed during production into a sequel to the 1994 game System Shock. The alterations were made when Electronic Arts—who owned the System Shock franchise rights—signed on as publisher.\nThe game takes place on board a starship in a cyberpunk depiction of 2114. The player assumes the role of a soldier trying to stem the outbreak of a genetic infection that has devastated the ship. Like System Shock, gameplay consists of first-person combat and exploration. It also incorporates role-playing system elements, in which the player can develop skills and traits, such as hacking and psionic abilities.\nSystem Shock 2 was originally released in August 1999 for Microsoft Windows. The game received critical acclaim but failed to meet commercial sales expectations. Many critics later determined that the game was highly influential in subsequent game design, particularly on first-person shooters, and considered it far ahead of its time. It has been included in several \"greatest games of all time\" lists. In 2007, Irrational Games released a spiritual successor to the System Shock series, titled BioShock, to critical acclaim and strong sales. System Shock 2 had been in intellectual property limbo following the closure of Looking Glass Studios. Night Dive Studios were able to secure the rights to the game and System Shock franchise in 2013 to release an updated version of System Shock 2 for modern operating systems, including for OS X and Linux, and announced plans to release an Enhanced Edition of the game. OtherSide Entertainment announced in 2015 that they have been licensed the rights from Night Dive Studios to produce a sequel, System Shock 3, but by 2020 have since been transferred to Tencent."},{"rank":82,"name":"Mortal Kombat 11","slug":"mortal-kombat-11","beatInfo":{"main":6,"mainExtra":17.5,"completionist":50},"imageUrl":"/games/62931_Mortal_Kombat_11.jpg","summary":"Mortal Kombat 11 is a 2019 fighting game developed by NetherRealm Studios and published by Warner Bros. Interactive Entertainment. Running on a heavily modified version of Unreal Engine 3, It is the eleventh main installment in the Mortal Kombat series and a sequel to 2015's Mortal Kombat X. Announced at The Game Awards 2018, the game was released in North America and Europe on April 23, 2019, for Microsoft Windows, Nintendo Switch, PlayStation 4, and Xbox One—with the exception of Europe's Switch version which was released on May 10, 2019. The game was released on Stadia on November 19, 2019.Upon release, the console versions of Mortal Kombat 11 received generally favorable reviews, which praised the gameplay, story, graphics, and improved netcode, but it received criticism for the presence of microtransactions and over-reliance on grinding.\nAn expansion for the game was released on May 26, 2020, entitled Mortal Kombat 11: Aftermath. This expansion includes an additional story mode, three new characters, new stages, and the return of stage fatalities and the friendship finishing move. An enhanced version of the game containing all downloadable content up to that point, titled Mortal Kombat 11: Ultimate, was released for the PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X/S on November 17, 2020."},{"rank":81,"name":"Persona 5 Royal","slug":"persona-5-royal","beatInfo":{"main":104,"mainExtra":125,"completionist":143},"imageUrl":"/games/66630_Persona_5_Royal.jpg","summary":"Persona 5 is a 2016 role-playing video game developed by Atlus. It takes place in modern-day Tokyo and follows a high school student known by the pseudonym Joker who transfers to a new school after being falsely accused of assault and put on probation. Over the course of a school year, he and other students awaken to a special power, becoming a group of secret vigilantes known as the Phantom Thieves of Hearts. They explore the Metaverse, a supernatural realm born from humanity's subconscious desires, to steal malevolent intent from the hearts of adults. As with previous games in the series, the party battles enemies known as Shadows using physical manifestations of their psyche known as their Personas. The game incorporates role-playing and dungeon crawling elements alongside social simulation scenarios.\nPersona 5 is the sixth installment in the Persona series, which is part of the larger Megami Tensei franchise. It was released for the PlayStation 3 and PlayStation 4 in Japan in September 2016 and worldwide in April 2017, and was published by Atlus in Japan and North America and by Deep Silver in Europe and Australia. An enhanced version featuring new content, Persona 5 Royal, was released for the PlayStation 4 in Japan in October 2019 and worldwide in March 2020, published by Atlus in Japan and North America and by franchise owner Sega in Europe and Australia. Royal is set for release on Nintendo Switch, PlayStation 5, Windows, Xbox One, and Xbox Series X/S in October 2022.\nPersona 5 was developed by P-Studio, an internal development studio within Atlus led by game director and producer Katsura Hashino. Along with Hashino, returning staff from earlier Persona games included character designer Shigenori Soejima and music composer Shoji Meguro. Preparatory work began during the development of Persona 4, with full development beginning after the release of Catherine in 2011. First announced in 2013, Persona 5 was delayed from its original late 2014 release date due to the game not being fully finished. Its themes revolve around attaining freedom from the limitations of modern society, while the story was strongly inspired by picaresque fiction; the party's Personas were based on outlaws and rebels from literature.\nPersona 5 won several awards and has been cited as one of the greatest role-playing video games of all time, with praise given to its visual presentation, gameplay, story, and music. Including Royal, it has sold over five million copies worldwide, making it the best-selling entry in the Megami Tensei franchise. Several other related media have also been released, including two spin-off games, Persona 5: Dancing in Starlight and Persona 5 Strikers, as well as manga and anime adaptations. The game's cast has also made appearances in other games, such as Joker appearing as a playable character in the 2018 crossover fighting game Super Smash Bros. Ultimate."},{"rank":80,"name":"Dark Souls","slug":"dark-souls","beatInfo":{"main":42.5,"mainExtra":60.5,"completionist":106},"imageUrl":"/games/Dark_Souls_Cover_Art.jpg","summary":"Dark Souls is a 2011 action role-playing game developed by FromSoftware and published by Namco Bandai Games. A spiritual successor to FromSoftware's Demon's Souls, the game is the second installment in the Souls series. Dark Souls takes place in the kingdom of Lordran, where players assume the role of a cursed undead character who begins a pilgrimage to discover the fate of their kind. A port for Windows known as the Prepare to Die Edition was released in August 2012 and featured additional content not seen in the original PlayStation 3 and Xbox 360 versions. The content was later released for consoles in October 2012 under the subtitle Artorias of the Abyss.\nDark Souls has been cited as one of the greatest video games ever made. Critics praised the depth of its combat, intricate level design, and use of flavor text. However, the game's difficulty received mixed reviews, with some criticizing it for being too unforgiving. The original Windows version of the game was less well-received, with criticism directed at several technical issues. By April 2013, the game had sold over two million copies worldwide. Two sequels were released in the mid-2010s, while a remastered version was released in 2018.\n\n"},{"rank":79,"name":"Fortnite","slug":"fortnite","beatInfo":{"main":66,"mainExtra":202,"completionist":212},"imageUrl":"/games/3657_Fortnite.jpg","summary":"Fortnite is an online video game developed by Epic Games and released in 2017. It is available in three distinct game mode versions that otherwise share the same general gameplay and game engine: Fortnite Battle Royale, a free-to-play battle royale game in which up to 100 players fight to be the last person standing; Fortnite: Save the World, a cooperative hybrid tower defense-shooter and survival game in which up to four players fight off zombie-like creatures and defend objects with traps and fortifications they can build; and Fortnite Creative, in which players are given complete freedom to create worlds and battle arenas. \nSave the World and Battle Royale were released in 2017 as early access titles, while Creative was released on December 6, 2018.\nWhile the Save the World and Creative versions have been successful for Epic Games, Fortnite Battle Royale in particular became an overwhelming success and a cultural phenomenon, drawing more than 125 million players in less than a year, earning hundreds of millions of dollars per month. Fortnite as a whole generated $9 billion in gross revenue up until December 2019.\nSave the World is available only for Windows, macOS, PlayStation 4, and Xbox One, while Battle Royale and Creative were released for all those platforms, and also for Nintendo Switch, iOS, and Android devices. The game also launched with the release of the next-generation PlayStation 5 and Xbox Series X/S consoles."},{"rank":78,"name":"Fable 2","slug":"fable-2","beatInfo":{"main":2.5,"mainExtra":3,"completionist":3.5},"imageUrl":"/games/60413_Endless_Fables_2_Frozen_Path.jpg","summary":"Fable II is a 2008 action role-playing open world video game, developed by Lionhead Studios and published by Microsoft Game Studios for Xbox 360. The game is the second installment in the Fable game series, and the sequel to 2004's Fable. The story takes place within the fictional land of Albion, 500 years after the first game. Players assume the role of a young hero who is destined to stop a former ruler turned madman from destroying the world. The game features several prominent actors portraying major characters in the game, including Zoë Wanamaker, Ron Glass and Stephen Fry. The game's setting takes inspiration from the historical late colonial era, in terms of architecture, social quality and basic firearms such as flintlock pistols.The game made several improvements over its predecessor, updating existing gameplay and offering larger locations to explore. Alongside the main story, players can engage in several side quests and repeatable jobs to earn money and rewards, build up a property empire, and customise their character with various clothing items, hairstyles, tattoos and makeup. Players also can make decisions on how they act, affecting their characters' morality and appearance as a result. New features to the game included the opportunity to choose between playing as a male or female character, a fast-travel system, and a canine companion who can detect treasures and alert the player to nearby enemies.\nFable II was released in October 2008 and achieved critical acclaim, many citing its adherence to the original while praising the changes that redefined the game system. The game later received two downloadable content packs  –  which introduced new locations, items and quests  –  which were released in a compilation with the main game, titled Fable II: Game of the Year, in September 2009. The game proved a commercial success, becoming the best selling title on Xbox 360 following its release. A sequel, Fable III, was released in 2010."},{"rank":77,"name":"GoldenEye 007","slug":"goldeneye-007","beatInfo":{"main":9.5,"mainExtra":16,"completionist":21.5},"imageUrl":"/games/256px-GoldenEye007box.jpg","summary":"Goldeneye may refer to:"},{"rank":76,"name":"Super Smash Bros. Ultimate","slug":"super-smash-bros-ultimate","beatInfo":{"main":23.5,"mainExtra":39.5,"completionist":69.5},"imageUrl":"/games/57513_Super_Smash_Bros_Ultimate.jpg","summary":"Super Smash Bros. Ultimate is a 2018 crossover fighting game developed by Bandai Namco Studios and Sora Ltd. and published by Nintendo for the Nintendo Switch. It is the fifth installment in the Super Smash Bros. series, succeeding Super Smash Bros. for Nintendo 3DS and Wii U. The game follows the series' traditional style of gameplay: controlling one of the various characters, players must use differing attacks to weaken their opponents and knock them out of an arena. It features a wide variety of game modes, including a campaign for single-player and multiplayer versus modes. Ultimate features 89 playable fighters, including all characters from previous Super Smash Bros. games alongside newcomers. The roster ranges from Nintendo mascots to characters from third-party franchises.\nPlanning for the game had begun by December 2015, with full development starting after the completion of 3DS/Wii U's downloadable content (DLC). Series creator and director Masahiro Sakurai returned along with Bandai Namco Studios and Sora, the studios that developed 3DS/Wii U, with the return of the studios speeding up the preparation process. Sakurai's goal with Ultimate was to include every character from previous games in the series despite the various development and licensing challenges this would present. Several well-known video game musicians contributed to the soundtrack, with Hideki Sakamoto writing the main theme \"Lifelight\".\nNintendo first teased Ultimate in a Nintendo Direct in March 2018 and fully revealed it at E3 2018 the following June. It later received two additional Directs before it was released on December 7, 2018. The game received universal acclaim, with some critics calling it the best of the series. They praised its amount of content and fine-tuning of existing Smash gameplay elements, although its online mode received criticism. Ultimate is the best-selling fighting game of all time, having nearly sold over 28 million copies by March 2022, and is a popular competitive fighting game. The game was supported with downloadable content adding new fighters, stages, and other content from its release until October 2021."},{"rank":75,"name":"Spelunky 2","slug":"spelunky-2","beatInfo":{"main":27,"mainExtra":78.5,"completionist":188},"imageUrl":"/games/75151_Spelunky_2.jpg","summary":"Spelunky 2 is a 2020 platform video game developed by Mossmouth and BlitWorks. It is the sequel to Spelunky (2008) and was released for PlayStation 4 and Windows in September 2020, for Nintendo Switch in August 2021, and for Xbox One and Xbox Series X/S in January 2022. The game received critical acclaim upon release."},{"rank":74,"name":"Return of the Obra Dinn","slug":"return-of-the-obra-dinn","beatInfo":{"main":8,"mainExtra":9.5,"completionist":10.5},"imageUrl":"/games/61882_Return_of_the_Obra_Dinn.jpg","summary":"Return of the Obra Dinn is an adventure and puzzle video game created by American video game designer Lucas Pope, and published by Japanese studio 3909. It was his second commercial game, following 2013's Papers, Please, and was released for macOS and Microsoft Windows in October 2018 and for the Nintendo Switch, PlayStation 4, and Xbox One a year later.\nThe game is set in 1807 with the player assuming the role of insurance inspector for the East India Company. The Obra Dinn, a merchant ship missing for five years, has reappeared off the coast of England with no one alive aboard. The player is dispatched to the ghost ship to perform an appraisal, reconstruct the events of the voyage, and determine the fates of all sixty souls aboard, providing a cause of death for those deceased or a probable current location for those presumed living. Investigation is accomplished through the use of the \"Memento Mortem\", a pocket watch capable of transporting its user to the moment of death of any corpse located. The game, played in first-person perspective, uses a \"1-bit\" monochromatic graphical style inspired by games on early Macintosh computers.\nReturn of the Obra Dinn was praised for its gameplay, art style, and narrative; it was cited as being among the best games of 2018 and won several awards, including the Seumas McNally Grand Prize.\n\n"},{"rank":73,"name":"Dota 2","slug":"dota-2","beatInfo":{"main":0,"mainExtra":1470,"completionist":1763},"imageUrl":"/games/250px-DotA2.jpg","summary":"Dota 2 is a 2013 multiplayer online battle arena (MOBA) video game developed and published by Valve. The game is a sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos. Dota 2 is played in matches between two teams of five players, with each team occupying and defending their own separate base on the map. Each of the ten players independently controls a powerful character known as a \"hero\" that all have unique abilities and differing styles of play. During a match players collect experience points and items for their heroes to successfully defeat the opposing team's heroes in player versus player combat. A team wins by being the first to destroy the other team's \"Ancient\", a large structure located within their base.\nDevelopment of Dota 2 began in 2009 when IceFrog, lead designer of Defense of the Ancients, was hired by Valve to create a modernized remake for them in the Source game engine. It was released for Windows, OS X, and Linux via the digital distribution platform Steam in July 2013, following a Windows-only open beta phase that began two years prior. The game is fully free-to-play with no heroes or any other gameplay element needing to be bought or otherwise unlocked. To maintain it, Valve supports the game as a service, selling loot boxes and a battle pass subscription system called Dota Plus that offer non-gameplay altering virtual goods in return, such as hero cosmetics and audio replacement packs. The game was ported to the Source 2 engine in 2015, making it the first game to use it.\nDota 2 has a large esports scene, with teams from around the world playing in various professional leagues and tournaments. Valve manages an event format known as the Dota Pro Circuit, a series of tournaments that award qualification points for earning direct invitations to The International, the game's premier tournament held annually. Internationals feature a crowdfunded prize money system that has seen amounts in upwards of US$40 million, making Dota 2 the most lucrative esport. Media coverage of most tournaments is done by a selection of on-site staff who provide commentary and analysis for the ongoing matches similar to traditional sporting events. In addition to playing live to audiences in arenas and stadiums, broadcasts of them are also streamed over the internet and sometimes simulcast on television, with peak viewership numbers in the millions.\nDespite some criticism going towards its steep learning curve and overall complexity, Dota 2 was praised for its rewarding gameplay, production quality, and faithfulness to its predecessor, with many considering it to be one of the greatest video games of all time. It has been one of the most played games on Steam since its release, with over a million concurrent players at its peak. The popularity of the game has led to official merchandise and media adaptations for it being produced, including comic books and an anime series, as well as promotional tie-ins to other games and media. The game also allows for the community to create their own gamemodes, maps, and cosmetics, which are uploaded to the Steam Workshop. Two spinoff games, Artifact and Dota Underlords, were also released by Valve. Dota 2 has also been used in machine learning experiments, with a team of bots known as the OpenAI Five showing the capability to defeat professional players."},{"rank":72,"name":"Mario Kart 8 Deluxe","slug":"mario-kart-8-deluxe","beatInfo":{"main":6,"mainExtra":22,"completionist":48.5},"imageUrl":"/games/43480_Mario_Kart_8_Deluxe.jpg","summary":"Mario Kart 8 is a kart racing game developed and published by Nintendo, and first released for the Wii U in May 2014. It retains Mario Kart series game mechanics, where players control Mario franchise characters in kart racing, collecting a variety of items to hinder opponents or gain advantages in the race. Mario Kart 8 introduces anti-gravity driving on walls or ceilings, and allows players to bump into each other for a short boost. It has single-player and multiplayer modes, including online via the Nintendo Network.\nMario Kart 8 was a critical and commercial success. Critics praised its new additions, tracks, graphics, gameplay, and orchestrated soundtrack, but criticized its limited battle mode. It is the best-selling Wii U game, with more than eight million copies sold worldwide. Nintendo continued to release patches and downloadable content, including additional characters, vehicles, and tracks, and support for Nintendo's Amiibo figurines.\nMario Kart 8 Deluxe, an enhanced version for the Nintendo Switch, was released in April 2017. It was also a critical and commercial success, with critics lauding the expansion of the battle mode, and became the best-selling Switch game. Both versions have sold a combined total of more than 53 million copies, making it one of the best-selling video games of all time.\n\n"},{"rank":71,"name":"Donkey Kong","slug":"donkey-kong","beatInfo":{"main":6,"mainExtra":0,"completionist":0},"imageUrl":"/games/Donkey_Kong_94_box_art.jpg","summary":"Donkey Kong is a video game franchise created by Shigeru Miyamoto and owned by Nintendo. It follows the adventures of an ape named Donkey Kong and his clan of other apes and monkeys. The franchise primarily consists of platform games—originally single-screen action puzzle games and later side-scrolling platformers. The first game was the 1981 arcade game Donkey Kong, featuring the eponymous character as the main antagonist in an industrial construction setting and the debut of both the Donkey Kong and Mario characters. The game was a massive success and was followed by two sequels released in 1982 and 1983. In 1994, the franchise was relaunched with the platformer Donkey Kong Country, in which Donkey Kong defeats a variety of anthropomorphic enemies, mainly the Kremlings, a clan of crocodiles led by King K. Rool who antagonize the Kongs by stealing their banana hoard.Games outside the platforming genre include spin-offs of various genres including rhythm games such as Donkey Konga, racing games such as Diddy Kong Racing, and edutainment such as Donkey Kong Jr. Math. An icon of the Donkey Kong franchise is barrels, which the Kongs use as weapons, vehicles, furniture, and lodging. The Donkey Kong franchise has sold a total of over 80 million copies worldwide as of 2022."},{"rank":70,"name":"The Sims 3","slug":"the-sims-3","beatInfo":{"main":80,"mainExtra":0,"completionist":0},"imageUrl":"/games/256px-Sims3cover.jpg","summary":"The Sims 3 is a 2009 life simulation video game developed by the Redwood Shores studio of Maxis, and published by Electronic Arts. Part of The Sims series, it is the sequel to The Sims 2. It was released on June 2, 2009, for macOS, Microsoft Windows and smartphone versions. Console versions were released for PlayStation 3, Xbox 360, and Nintendo DS in October 2010 and a month later for Wii. The Windows Phone version was released on October 15, 2010. A Nintendo 3DS version, released on March 27, 2011, was one of the platform's launch titles.The game follows the same premises as its predecessors The Sims and The Sims 2 and is based around a life simulation where the player controls the actions and fates of its characters, the Sims, as well as their houses and neighbourhoods. The Sims 3 expands on previous games in having an open world system, where neighbourhoods are completely open for the sims to move around without any loading screens. A new design tool is introduced, the Create-a-Style tool, which allows every object, clothing and hair to be redesigned in any color, material or design pattern.\nThe Sims 3 was a commercial success, selling 1.4 million copies in its first week. It received mostly positive reviews from critics, with an 86/100 score from aggregator Metacritic indicating \"generally favorable\" reviews. The game has sold over ten million copies worldwide since its 2009 release, making it one of the best-selling PC games of all time. The Sims 3 has additionally received eleven expansion packs and nine stuff packs. A sequel, The Sims 4, was released in September 2014 for PC and in November 2017 for consoles to mixed reviews, largely due to the removal of the open world, Create-a-Style tool and lack of content."},{"rank":69,"name":"Splinter Cell: Chaos Theory","slug":"splinter-cell-chaos-theory","beatInfo":{"main":13,"mainExtra":14,"completionist":19},"imageUrl":"/games/Tom_Clancys_Splinter_Cell_-_Chaos_Theory_Coverart.png","summary":"Tom Clancy's Splinter Cell: Chaos Theory is a stealth game developed by Ubisoft Montreal and Ubisoft Milan and released in March 2005 for the Xbox, PlayStation 2 (PS2), GameCube and Microsoft Windows. Handheld versions for the Nintendo DS, mobile, and N-Gage were also released. A Game Boy Advance port was planned, but later cancelled.\nChaos Theory is the third game in the Splinter Cell series endorsed by novelist Tom Clancy. As with previous entries in the franchise, Chaos Theory follows the activities of Sam Fisher, an agent working for a covert-ops branch within the NSA called \"Third Echelon\". The game has a significantly darker tone than its predecessors, featuring more combat and the option for Fisher to kill people he interrogates as opposed to merely knocking them out. As a result, it was the first Splinter Cell game to receive an M-rating by the ESRB, an assessment which has since been applied to all subsequent releases in the series. Actor Michael Ironside reprised his role as Fisher, while Don Jordan returned from the original game to voice Third Echelon director Irving Lambert and Claudia Besso returned as hacker and analyst Anna Grímsdóttir having both been replaced by Dennis Haysbert and Adriana Anderson respectively in Tom Clancy's Splinter Cell: Pandora Tomorrow.\nChaos Theory was a commercial success, selling 2.5 million units across all platforms within a month of its release. The Xbox and PC versions of the game received critical acclaim; the GameCube and PlayStation 2 iterations were also released to generally positive reviews. Official Xbox Magazine named it the Xbox \"Game of the Year\" (2005) for its strong gameplay and lifelike graphics. It is considered one of the greatest video games ever made. A remastered HD edition was bundled with the first two games of the series as part of the Splinter Cell Trilogy for the PlayStation 3, released on December 20, 2010. Another port titled Tom Clancy's Splinter Cell 3D was released for the Nintendo 3DS on March 25, 2011."},{"rank":68,"name":"Super Mario World 2: Yoshi's Island","slug":"super-mario-world-2-yoshis-island","beatInfo":{"main":8,"mainExtra":11.5,"completionist":16.5},"imageUrl":"/games/Yisland_box.jpg","summary":"Super Mario World 2: Yoshi's Island is a 1995 platform game developed and published by Nintendo for the Super Nintendo Entertainment System (SNES). The player controls Yoshi, a friendly dinosaur, on a quest to reunite baby Mario with his brother Luigi, who has been kidnapped by Kamek. As a Super Mario series platformer, Yoshi runs and jumps to reach the end of the level while solving puzzles and collecting items with Mario's help. The game has a hand-drawn aesthetic and was the first in the franchise to have Yoshi as its main character, where it introduces his signature flutter jump and egg spawning abilities.\nAfter four years of development, Yoshi's Island was released in Japan in August 1995 and worldwide two months later. Some of its special effects were powered by a new Super FX2 microchip. The game was ported to the Game Boy Advance as Super Mario Advance 3: Yoshi's Island in 2002. This version was rereleased for the Nintendo 3DS and the Wii U's Virtual Console in the early 2010s. The original version was also released for the Super NES Classic Edition and Nintendo Switch Online in the late 2010s.\nYoshi's Island received acclaim and sold over four million copies. Reviewers praised the art, sound, level design, and gameplay, and posited Yoshi's Island as a masterpiece and one of the greatest video games of all time. The game brought newfound renown to both Yoshi as a character and Shigeru Miyamoto's artistic and directorial career. The distinct art style and Yoshi's signature characteristics established the Yoshi series of spin-offs and sequels. The game would be the last Super Mario platformer before the series' transition to 3D gameplay, with no further 2D entries for over a decade.\nA sequel, Yoshi's Island DS, was released in 2006. In 2014, Yoshi's New Island was released as a retcon of the games that originally followed Yoshi's Island."},{"rank":67,"name":"Silent Hill 2","slug":"silent-hill-2","beatInfo":{"main":8,"mainExtra":9.5,"completionist":16},"imageUrl":"/games/250px-Silent_Hill_2.jpg","summary":"Silent Hill 2 is a 2001 survival horror game developed by Team Silent, a group in Konami Computer Entertainment Tokyo, and published by Konami. The game was released from September to November, originally for the PlayStation 2. The second installment in the Silent Hill series, Silent Hill 2 centers on James Sunderland, a widower who journeys to the town of Silent Hill after receiving a letter from his dead wife informing him that she is waiting there for him. An extended version containing an extra bonus scenario, Born from a Wish, and other additions was published for Xbox in December of the same year. In 2002, it was ported to Microsoft Windows and re-released on PlayStation 2 as a Greatest Hits version, which includes all bonus content from the Xbox port. A remastered high-definition version was released for the PlayStation 3 and Xbox 360 in 2012 as part of the Silent Hill HD Collection.\nWork on Silent Hill 2 began in June 1999, soon after Silent Hill had been completed. Its narrative was inspired by the Russian novel Crime and Punishment (1866) by Fyodor Dostoevsky, and some of the influences on the game's artistic style include the work of film directors David Cronenberg, David Fincher, David Lynch, and Alfred Hitchcock; cultural references to history, films and literature can be found in the game. In contrast with the previous title, whose narrative concerned cult activity, Silent Hill 2 focuses directly on the psychology of its characters.\nSilent Hill 2 received critical acclaim. Within the month of its release in North America, Japan, and Europe, over one million copies were sold, with the greatest number of sales in North America. During release, it was widely praised for its story, use of metaphors, symbolism, psychological horror, and taboo topics, soundtrack, atmosphere, graphics, monster designs, and sound design. However, it received criticism for its controls despite their improvement over the previous game's. It is often considered to be one of the greatest horror games ever made and among the greatest video games of all time, as well as a key example of video games as an art form. The game was followed by Silent Hill 3 in 2003."},{"rank":66,"name":"Grand Theft Auto: San Andreas","slug":"grand-theft-auto-san-andreas","beatInfo":{"main":30.5,"mainExtra":46,"completionist":80},"imageUrl":"/games/GTASABOX.jpg","summary":"Grand Theft Auto: San Andreas is a 2004 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the fifth main entry in the Grand Theft Auto series, following 2002's Grand Theft Auto: Vice City, and the seventh installment overall. It was released in October 2004 for the PlayStation 2, in June 2005 for Microsoft Windows and Xbox, and in November 2010 for Mac OS X. The game is set within an open world environment that players can explore and interact with at their leisure. The story follows former gangster Carl \"CJ\" Johnson, who returns home following his mother's murder and is drawn back into his former gang and a life of crime while clashing with corrupt authorities and powerful criminals. Carl's journey takes him across the fictional U.S. state of San Andreas, which is heavily based on California and Nevada and encompasses three major cities: Los Santos (inspired by Los Angeles), San Fierro (San Francisco) and Las Venturas (Las Vegas).The game features references to many real-life elements of the world, such as its cities, regions, and landmarks, with its plot heavily based on several real-life events in Los Angeles in the early 1990s, including the rivalry between real-life street gangs, the crack epidemic of the 1980s and early 1990s, the LAPD Rampart scandal, and the 1992 Los Angeles riots. Unlike its predecessor, San Andreas introduced gameplay elements that were incorporated in later games, including RPG-style mechanics, customisation options with both clothing and vehicle appearances, a vast array of activities and mini-games, and the inclusion of gambling games.\nConsidered by many reviewers to be one of the greatest video games ever made, San Andreas received critical acclaim upon release, with praise directed at its music, story and gameplay, and criticism for its graphics and some aspects of its controls. It was the best-selling video game of 2004, and with over 27.5 million copies sold worldwide as of 2011, it is the best-selling PlayStation 2 game  and one of the best-selling video games of all time. Like its predecessors, San Andreas is cited as a landmark in video games for its far-reaching influence within the industry. The game's violence and sexual content was the source of much public concern and controversy. In particular, a player-made software patch, dubbed the \"Hot Coffee mod\", unlocked a previously hidden sexual scene. A remastered version of the game was released for Android and iOS in 2013, for Windows Phone, Fire OS and Xbox 360 in 2014, and for PlayStation 3 in 2015. In June 2018, the game was made available for the Xbox One via backward compatibility. An enhanced version with the subtitle The Definitive Edition was released in 2021, and a virtual reality version for Oculus Quest 2 is in development. The next main entry in the series, Grand Theft Auto IV, was released in April 2008."},{"rank":65,"name":"XCOM 2","slug":"xcom-2","beatInfo":{"main":33,"mainExtra":46.5,"completionist":72},"imageUrl":"/games/XCOM_2_2015.jpg","summary":"XCOM 2 is a 2016 turn-based tactics video game developed by Firaxis Games and published by 2K Games. It is the sequel to 2012's reboot of the series, XCOM: Enemy Unknown; it takes place 20 years after the events of Enemy Unknown. XCOM, a military organization trying to fight off an alien invasion, has lost the war and is now a resistance force against the occupation of Earth and the established totalitarian regime and military dictatorship. Gameplay is split between turn-based combat in which players command a squad of soldiers to fight enemies, and strategy elements in which players manage and control the operations of the Avenger, an alien ship that is used as a mobile base for XCOM.\nFollowing players' feedback on Enemy Unknown, Firaxis added procedural generation of maps and mod support to the game. The developers set the game after the bad ending of the 2012 reboot because it allowed them to change gameplay, introduce various new features and redesign some enemies. To encourage players to play more offensively, the developers introduced time-based objectives to boost the game's pacing. Compared with its predecessor, XCOM 2 has more emphasis on narrative. The artists drew inspiration from sci-fi movies including Elysium and Oblivion when creating the game's aesthetic. The game is powered by Unreal Engine 3.5.\nXCOM 2 was released in February 2016 for personal computers; PlayStation 4 and Xbox One versions were released in September 2016. Upon release, the game received critical acclaim. Critics praised the new concealment system, which they said adds a new layer of depth, and the procedural generation of maps. The game was also praised for its difficulty and the addition of modding tools; criticism was mainly directed at its poor performance at launch. It was nominated for multiple year-end accolades by several gaming publications. Firaxis supported the game with downloadable content and released XCOM 2: War of the Chosen, the game's expansion, in 2017. A Nintendo Switch port was released on May 29, 2020. An iOS version, XCOM 2 Collection, was released by Feral Interactive on November 5, 2020. An Android version was released on July 13, 2021."},{"rank":64,"name":"Control","slug":"control","beatInfo":{"main":11.5,"mainExtra":18.5,"completionist":28},"imageUrl":"/games/57507_Control.jpg","summary":"Control may refer to:\n\n"},{"rank":63,"name":"Call of Duty 4: Modern Warfare","slug":"call-of-duty-4-modern-warfare","beatInfo":{"main":7,"mainExtra":9.5,"completionist":16},"imageUrl":"/games/Call_of_Duty_4_Modern_Warfare.jpg","summary":"Call of Duty 4: Modern Warfare is a 2007 first-person shooter video game developed by Infinity Ward and published by Activision. It is the fourth main installment in the Call of Duty series. The game breaks away from the World War II setting of previous entries and is instead set in modern times. Developed for over two years, Modern Warfare was released in November 2007 for the PlayStation 3, Xbox 360 and Microsoft Windows, and was ported to the Wii as Call of Duty: Modern Warfare – Reflex Edition in 2009.\nThe story takes place in the year of 2011, where a radical leader has executed the president of an unnamed country in the Middle East, and an ultranationalist movement ignites a civil war in Russia. The conflicts are seen from the perspectives of a U.S. Marine Force Recon sergeant and a British SAS commando and are set in various locales, such as the United Kingdom, the Middle East, Azerbaijan, Russia, and Ukraine. The multiplayer portion of the game features various game modes and contains a leveling system that allows the player to unlock additional weapons, weapon attachments, and camouflage schemes as they advance.\nThe game received universal acclaim from critics, with praise towards the gameplay and story, but criticism for the lack of innovation. The game won numerous awards from gaming websites, including IGN's \"Best Xbox 360 Game\". The game is considered one of the greatest video games of all time. It was the top-selling game worldwide for 2007, selling around seven million copies by January 2008 and almost sixteen million by November 2013. It was followed by two sequels that continue the storyline: Call of Duty: Modern Warfare 2 (2009) and Call of Duty: Modern Warfare 3 (2011).\nA remastered version of the game, Call of Duty: Modern Warfare Remastered, was released as part of special edition bundles of Call of Duty: Infinite Warfare in November 2016, and as a standalone game in June 2017. A reboot of the Modern Warfare games, Call of Duty: Modern Warfare, was released in October 2019."},{"rank":62,"name":"Rise of the Tomb Raider","slug":"rise-of-the-tomb-raider","beatInfo":{"main":13.5,"mainExtra":21.5,"completionist":35},"imageUrl":"/games/250px-Rise_of_the_Tomb_Raider.jpg","summary":"Rise of the Tomb Raider is a 2015 action-adventure video game developed by Crystal Dynamics and published by Microsoft Studios and Square Enix's European subsidiary. The game is the eleventh main entry in the Tomb Raider series, the sequel to the 2013's Tomb Raider, and is the second instalment in the Survivor trilogy. Its story follows Lara Croft as she ventures into Siberia in search of the legendary city of Kitezh while battling the paramilitary organization Trinity, which intends to uncover the city's promise of immortality. Lara must traverse the environment and combat enemies with firearms and stealth as she explores semi-open hubs. In these hubs she can raid challenge tombs to unlock new rewards, complete side missions, and scavenge for resources which can be used to craft useful materials.\nDevelopment of Rise of the Tomb Raider closely followed the conclusion of development of the 2013 reboot. Player feedback was considered during development, with the team reducing the number of quick time events and introducing more puzzles and challenge tombs. The team traveled to several locations in Turkey, including Cappadocia, Istanbul and Ephesus, to design Kitezh. Rhianna Pratchett returned as the game's writer while Bobby Tahouri replaced Jason Graves as the game's composer. Camilla Luddington returned to provide voice and motion-capture work for Lara. Powered by the Foundation engine, the game was also developed by Eidos-Montréal and Nixxes Software.\nRise of the Tomb Raider was announced at E3 2014 by Microsoft Studios. It was revealed as a timed exclusive for Xbox 360 and Xbox One at Gamescom 2014, which sparked criticism from the gaming press and community. The game received generally positive reviews, with critics praising its graphics, gameplay, characterization, and abundance of content; however, some reviewers felt that the game did not take enough risks. As of November 2021, the game had sold around 11.8 million copies. Several downloadable story and content additions have been released for digital purchase. Square Enix released the game for Microsoft Windows and PlayStation 4 in 2016.  A sequel, Shadow of the Tomb Raider, was released in September 2018."},{"rank":61,"name":"Batman: Arkham City","slug":"batman-arkham-city","beatInfo":{"main":12.5,"mainExtra":21.5,"completionist":46},"imageUrl":"/games/250px-ArkhamCity.jpg","summary":"Batman: Arkham City is a 2011 action-adventure game developed by Rocksteady Studios and published by Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman, it is the sequel to the 2009 video game Batman: Arkham Asylum and the second installment in the Batman: Arkham series. Written by veteran Batman writer Paul Dini with Paul Crocker and Sefton Hill, Arkham City was inspired by the long-running comic book mythos. In the game's main storyline, Batman is incarcerated in Arkham City, a super-prison enclosing the decaying urban slums of fictional Gotham City. He must uncover the secret behind a sinister scheme orchestrated by the facility's warden, Hugo Strange. The game's leading characters are predominantly voiced by actors from the DC Animated Universe, with Kevin Conroy and Mark Hamill reprising their roles as Batman and the Joker, respectively.\nThe game is presented from the third-person perspective with a primary focus on Batman's combat and stealth abilities, detective skills, and gadgets that can be used in both combat and exploration. Batman can freely move around the Arkham City prison, interacting with characters and undertaking missions, and unlocking new areas by progressing through the main story or obtaining new equipment. The player is able to complete side missions away from the main story to unlock additional content and collectible items. Batman's ally Catwoman is another playable character, featuring her own story campaign that runs parallel to the game's main plot.\nRocksteady conceived ideas for a sequel while developing Arkham Asylum, commencing serious development of Arkham City's story in February 2009. The layout of Arkham City has a virtual footprint five times that of Arkham Asylum, and the city design was modified to accommodate Batman's ability to swoop and glide. Over a year and $10 million were spent on the game's marketing campaign, and its release was accompanied by two music albums; one containing the game's score, and the other featuring 11 original songs inspired by the game from various mainstream artists.\nArkham City was released worldwide for the PlayStation 3 and Xbox 360 video game consoles in October 2011, followed by a Microsoft Windows version a month later. The game received critical acclaim, particularly for its narrative, character and world designs, soundtrack, and Batman's combat and navigation abilities. It was tied with The Elder Scrolls V: Skyrim for the highest-rated video game of 2011 according to review aggregator Metacritic, and was the recipient of several awards from media outlets, including Game of the Year, Best Action Game, Best Action Adventure Game, Best Adventure Game, and Best Original Score. Like its predecessor, it is considered one of the greatest video games of all time. A spin-off mobile game, Batman: Arkham City Lockdown was released in December. Arkham City has received several re-releases, comprising: a Game of the Year edition in May 2012; Wii U and OS X versions in November and December 2012, respectively; and a remastered version for PlayStation 4 and Xbox One in October 2016. A prequel to the series, Batman: Arkham Origins, was released in October 2013, and a narrative sequel, Batman: Arkham Knight, was released in June 2015."},{"rank":60,"name":"Dishonored 2","slug":"dishonored-2","beatInfo":{"main":12.5,"mainExtra":22.5,"completionist":45},"imageUrl":"/games/26731_Dishonored_2.jpg","summary":"Dishonored 2 is a 2016 action-adventure video game developed by Arkane Studios and published by Bethesda Softworks for Microsoft Windows, PlayStation 4, and Xbox One. It is the sequel to 2012's Dishonored. After Empress Emily Kaldwin is deposed by the witch Delilah Copperspoon, the player may choose between playing as either Emily or her Royal Protector and father Corvo Attano as they attempt to reclaim the throne. Emily and Corvo employ their own array of supernatural abilities, though the player can alternatively decide to forfeit these abilities altogether. Due to the game's nonlinear gameplay, there are a multitude of ways to complete missions, from non-lethal stealth to purposeful violent conflict.\nIdeas for Dishonored 2 began while developing the downloadable content of its predecessor, which spawned the decision to create a voice for Corvo Attano after being a silent character in the first installment. The advancement of the timeline was brought about once Emily Kaldwin, a child in Dishonored, was proposed as a playable character. The game's aesthetic was influenced by paintings and sculptures. Set in the fictional city of Karnaca, its history was invented in the span of one year. The city itself was based on Southern European/Mediterranean countries like Greece, Italy, and Spain, drawing on the architecture, fashion, and technologies of 1851. Voice actors include Rosario Dawson, Sam Rockwell, Robin Lord Taylor, Jamie Hector, Pedro Pascal, and Vincent D'Onofrio.\nDishonored 2 was released to a positive reception. Praised were the improvements made since the first game: the more challenging stealth, the adaptability of Emily and Corvo's abilities to both play styles, the art direction, the creative design of individual missions, the realization of the game's world as well as the replay-value and the artificial intelligence. Criticism was directed at the lack of focus of the overarching narrative. Aside from this, technical blunders, as well as issues with the PC version at launch, were received unfavorably, and the lack of content at launch was criticized. To remedy these problems, the game was updated numerous times during its life-cycle, with a New Game Plus mode, quick save and quick load feature, and a customizable difficulty setting being added in the game. Dishonored 2 won the award for Best Action/Adventure Game at The Game Awards 2016 and for Costume Design at the 2017 NAVGTR Awards."},{"rank":59,"name":"The Witness","slug":"the-witness","beatInfo":{"main":17,"mainExtra":24.5,"completionist":41},"imageUrl":"/games/250px-The_witness_poster.jpg","summary":"A witness is someone who has first-hand knowledge of something, especially a crime or dramatic event, and usually by seeing it.\nWitness may also refer to:"},{"rank":58,"name":"Journey","slug":"journey","beatInfo":{"main":2,"mainExtra":2.5,"completionist":5.5},"imageUrl":"/games/256px-Journey_logo_lowres.jpg","summary":"Journey or journeying may refer to:\n\nTravel, the movement of people between distant geographical locations\nDay's journey, a measurement of distance\nRoad trip, a long-distance journey on the road"},{"rank":57,"name":"Uncharted 2: Among Thieves","slug":"uncharted-2-among-thieves","beatInfo":{"main":10.5,"mainExtra":12.5,"completionist":21.5},"imageUrl":"/games/Uncharted_2_updated_PS3_logo.jpg","summary":"Uncharted 2: Among Thieves is a 2009 action-adventure game developed by Naughty Dog and published by Sony Computer Entertainment. It is the second game in the Uncharted series, and was released in October 2009 for PlayStation 3. Set two years after the events of Drake's Fortune (2007), the single-player story follows Nathan Drake, Chloe Frazer, and Elena Fisher as they search for the Cintamani Stone and Shambhala while battling a militia led by war criminal Zoran Lazarević.\nDevelopment for Uncharted 2: Among Thieves began immediately following the critical and commercial success of the first entry. The development team drew inspiration from explorer Marco Polo and his expeditions through archipelagos and eastern Asia. Naughty Dog developed an updated proprietary engine for Uncharted 2: Among Thieves, which runs exclusively on the Naughty Engine 2.0 system. These improvements enabled extensive motion capture, greater in-game cinematic sequences, and inclusion of an online multiplayer component, a first for the franchise.\nUncharted 2: Among Thieves received critical acclaim for its elaborate set pieces, character design, storytelling, graphics, technical innovation, and gameplay mechanics. It received Game of the Year accolades from numerous publications and award events, and is considered to be one of the greatest video games ever made, and among the most significant titles for the seventh console generation. It also enjoyed great commercial success, with over six million copies sold worldwide. The game was followed by a sequel titled Uncharted 3: Drake's Deception in 2011, and was re-released on PlayStation 4 as part of Uncharted: The Nathan Drake Collection."},{"rank":56,"name":"Overwatch","slug":"overwatch","beatInfo":{"main":0,"mainExtra":0,"completionist":291},"imageUrl":"/games/31590_Overwatch.jpg","summary":"Overwatch is a 2016 team-based multiplayer first-person shooter game developed and published by Blizzard Entertainment. Described as a \"hero shooter\", Overwatch assigns players into two teams of six, with each player selecting from a large roster of characters, known as \"heroes\", with unique abilities. Teams work to complete map-specific objectives within a limited period of time. Blizzard has added new characters, maps, and game modes post-release, all free of charge, with the only additional cost to players being optional loot boxes to purchase cosmetic items. It was released for PlayStation 4, Xbox One, and Windows in May 2016 and Nintendo Switch in October 2019. An optimized performance patch for the Xbox Series X and Series S was released in March 2021. Cross-platform play is supported across all platforms.\nOverwatch is Blizzard's fourth major franchise and came about following the 2014 cancellation of a massively multiplayer online role-playing game, Titan. A portion of the Titan team were inspired by the success of team-based first-person shooters like Team Fortress 2 and the popularity of multiplayer online battle arena games, creating a hero-based shooter which emphasized teamwork. Some elements of Overwatch borrow concepts from the canceled Titan project.\nOverwatch was unveiled at the 2014 BlizzCon event and was in a closed beta from late 2015 through early 2016. An open beta before release drew in nearly 10 million players. Overwatch received universal acclaim from critics, who praised the game for its accessibility, the diverse appeal of its hero characters, its cartoonish art style, and enjoyable gameplay. Blizzard reported over US$1 billion in revenue during the first year of its release and had more than 50 million players after three years. Overwatch is considered to be among the greatest video games ever made, receiving numerous game of the year awards and other accolades. The game is a popular esport, with Blizzard funding and producing the global Overwatch League.\nA sequel, Overwatch 2, was announced in 2019 and entered public beta in 2022. The player versus player portion of the game will be free to play, with all cosmetic items from Overwatch carried over while introducing new heroes, maps, and gamemodes. A player versus environment (PvE) co-operative multiplayer mode will be released at a later time."},{"rank":55,"name":"Apex Legends","slug":"apex-legends","beatInfo":{"main":0,"mainExtra":0,"completionist":139},"imageUrl":"/games/64753_Apex_Legends.jpg","summary":"Apex Legends is a free-to-play battle royale-hero shooter game developed by Respawn Entertainment and published by Electronic Arts. It was released for Microsoft Windows, PlayStation 4, and Xbox One in February 2019, for Nintendo Switch in March 2021, and for PlayStation 5 and Xbox Series X/S in March 2022. A mobile version of the game designed for touchscreens titled Apex Legends Mobile was released in May 2022 on Android and iOS. The game supports cross-platform play, excluding the aforementioned mobile platforms.\nBefore the match, players form into two- or three-player squads, and select from pre-designed characters with distinctive abilities, known as \"Legends\". The game has two gameplay modes. In \"Battle Royale\", up to 20 three-person squads or 30 two-person duos land on an island and search for weapons and supplies before attempting to defeat all other players in combat. The available play area on the island shrinks over time, forcing players to keep moving or else find themselves outside the play area which can be fatal. The final team alive wins the round. In \"Arenas\", players form into three-player squads and fight against another squad in a 3v3 team deathmatch over a series of rounds to determine the winner of the match. Teams win when their team has at least 3 points and is 2 points ahead.\nApex Legends is set in the same science fiction universe as Respawn Entertainment's Titanfall series, with several characters from the Titanfall series appearing either as minor characters or playable Legends. Work on the game began around late 2016, though the project remained a secret right up until its launch. The game's release in 2019 came as a surprise, as until that point it had been assumed that Respawn Entertainment was working on a third installment to the Titanfall franchise, the studio's previous major game. Apex Legends received generally positive reviews from critics, who praised its gameplay, progression system, and fusion of elements from various genres. Some considered it a worthy competitor to other battle royale games. Apex Legends surpassed 25 million players by the end of its first week, and 50 million within its first month. By April 2021, it had approximately 100 million players making it one of the most played video games of all time by player count."},{"rank":54,"name":"Hollow Knight","slug":"hollow-knight","beatInfo":{"main":26.5,"mainExtra":41,"completionist":60},"imageUrl":"/games/Hollow_Knight_collection_branding.jpg","summary":"Hollow Knight is a 2017 Metroidvania action-adventure game developed and published by independent developer Team Cherry. In the game, the player controls the Knight, a nameless insectoid warrior. The Knight explores Hallownest, a fallen kingdom plagued by a supernatural disease. The game is set in diverse subterranean locations, and it features friendly and hostile bug-like characters and numerous bosses. Players have the opportunity to unlock new abilities as they explore each location, along with pieces of lore and flavor text that are spread throughout the kingdom.\nThe concept behind Hollow Knight was originally conceived in 2013 in the Ludum Dare game jam. Team Cherry wanted to create a game inspired by older platformers that replicated the explorational aspects of its influences. Inspirations for the game include Faxanadu, Metroid, Zelda II: The Adventure of Link, and Mega Man X. Development was partially funded through a Kickstarter crowdfunding campaign that raised over A$57,000 by the end of 2014. It was released for Microsoft Windows, macOS, and Linux in early 2017 and for the Nintendo Switch, PlayStation 4, and Xbox One in 2018. After release, Team Cherry supported the game with four expansions.\nHollow Knight received widespread acclaim from critics, who highlighted the game's worldbuilding, music, character design, and combat mechanics, with emphasis on the extensive story. By December 2020, the game had sold 3 million copies. A sequel, Hollow Knight: Silksong, is currently in development."},{"rank":53,"name":"Ms. Pac-Man","slug":"ms-pac-man","beatInfo":{"main":1,"mainExtra":2,"completionist":3},"imageUrl":"/games/6253_Ms_Pac-Man.jpg","summary":"Ms. Pac-Man is a 1982 maze arcade game developed by General Computer Corporation and published by Midway. It is the first sequel to Pac-Man (1980) and the first entry in the series to not be made by Namco. Controlling the title character, Pac-Man's wife, the player is tasked with eating all of the pellets in an enclosed maze while avoiding four colored ghosts. Eating the larger \"power pellets\" lets the player eat the ghosts, who turn blue and flee.\nGeneral Computer originally made the game as a modification kit for the original Pac-Man, titled Crazy Otto. However, due to previous legal action with Atari, GCC was forced to present the project to Midway, the North American distributor of Pac-Man. Midway purchased the project and enlisted GCC to use the game as a basis for the sequel to Pac-Man. Multiple names were considered for the game, including Miss Pac-Man and Mrs. Pac-Man, before the final name was chosen for being easier to pronounce. While development had originally started without Namco's consent, company president Masaya Nakamura was brought in and provided feedback on the player character's design. The company ultimately collected the same royalties on each cabinet as they had with Pac-Man.\nMs. Pac-Man was acclaimed by critics for its improvements to the original gameplay and for having a female protagonist; some have described it as superior to Pac-Man. It has been listed among the greatest video games of all time and as one of the most successful American arcade games ever made.  The game's success inspired a variety of successful merchandise, several ports for numerous home consoles and handheld systems, a television cartoon that included Pac-Man, and numerous video game sequels and remakes that spawned a Ms. Pac-Man video game spin-off series. The rights to the game are owned by Namco's successor company, Bandai Namco Entertainment."},{"rank":52,"name":"Counter-Strike 1.6","slug":"counter-strike-16","beatInfo":{"main":0,"mainExtra":0,"completionist":0},"imageUrl":"","summary":"Counter-Strike (also known as Half-Life: Counter-Strike or Counter-Strike 1.6) is a first-person shooter game developed by Valve. It was initially developed and released as a Half-Life modification by Minh \"Gooseman\" Le and Jess Cliffe in 1999, before Le and Cliffe were hired and the game's intellectual property acquired. Counter-Strike was released by Valve for Microsoft Windows in 2000, and is the first installment in the Counter-Strike series. Several remakes and ports were released on Xbox, as well as OS X and Linux.\nSet in various locations around the globe, players assume the roles of counter-terrorist forces and terrorist militants opposing them. During each round of gameplay, the two teams are tasked with defeating the other by the means of either achieving the map's objectives or eliminating all of the enemy combatants. Each player may customize their arsenal of weapons and accessories at the beginning of every match, with currency being earned after the end of each round."},{"rank":51,"name":"Left 4 Dead 2","slug":"left-4-dead-2","beatInfo":{"main":9.5,"mainExtra":24,"completionist":50},"imageUrl":"/games/250px-Left4Dead2.jpg","summary":"Left 4 Dead 2 is a 2009 first-person shooter game developed and published by Valve. The sequel to Turtle Rock Studios's Left 4 Dead (2008) and the second game in the Left 4 Dead series, it was released for Microsoft Windows and Xbox 360 in November 2009, Mac OS X in October 2010, and Linux in July 2013.Left 4 Dead 2 builds upon cooperatively focused gameplay and Valve's proprietary Source engine, the same game engine used in the original Left 4 Dead. Set during the aftermath of an apocalyptic pandemic, the game focuses on four new Survivors, fighting against hordes of zombies known as the Infected, who develop severe psychosis and act extremely aggressive. The Survivors must fight their way through five campaigns, interspersed with safe houses that act as checkpoints, with the goal of escape at each campaign's finale. The gameplay is procedurally altered by the \"AI Director 2.0\", which monitors the players' performance and adjusts the scenario to provide a dynamic challenge. Other new features include new types of special infected and an arsenal of melee weapons.The game made its world premiere at E3 2009 with a trailer during the Microsoft press event. Prior to release, it received mixed critical and community reactions, and attracted an unusually high volume of controversy about its graphic content. In response, alterations were made to the cover art, but both Australia and Germany refused to rate the unmodified edition at the time of release. Despite this, the game was met with positive critical reviews, and is considered to be one of the greatest video games ever made."},{"rank":50,"name":"EarthBound","slug":"earthbound","beatInfo":{"main":28,"mainExtra":32.5,"completionist":39},"imageUrl":"/games/250px-EarthBound_Box.jpg","summary":"EarthBound, released in Japan as Mother 2: Gīgu no Gyakushū, is a role-playing video game developed by Ape Inc. and HAL Laboratory and published by Nintendo for the Super Nintendo Entertainment System. The second entry in the Mother series, it was first released in Japan in August 1994, and in North America in June 1995. As Ness and his party of four, Paula, Jeff and Poo, the player travels the world to collect melodies from eight Sanctuaries in order to defeat the universal cosmic destroyer Giygas.\nEarthBound had a lengthy development period that spanned five years. Its returning staff from Mother (1989) included writer/director Shigesato Itoi and lead programmer Satoru Iwata, as well as composers Keiichi Suzuki and Hirokazu Tanaka, who incorporated a diverse range of styles into the soundtrack, including salsa, reggae, and dub. Most of the other staff members had not worked on the original Mother, and the game came under repeated threats of cancellation until Iwata joined the team. Originally scheduled for release in January 1993, the game was completed around May 1994.\nThemed around an idiosyncratic portrayal of Americana and Western culture, EarthBound subverted popular role-playing game traditions by featuring a modern setting while parodying numerous staples of the genre. Itoi wanted the game to reach non-gamers with its intentionally goofy tone; for example, the player uses items such as the Pencil Eraser to remove pencil statues, experiences in-game hallucinations, and battles piles of vomit, taxi cabs, and walking nooses. For its American release, the game was marketed with a $2 million promotional campaign that sardonically proclaimed \"this game stinks\". The game's puns and humor were reworked by localizer Marcus Lindblom. Since the original Mother had not been released outside Japan, Mother 2 was called EarthBound to avoid confusion about what it was a sequel to.\nAlthough it was positively received by Japanese audiences, EarthBound sold poorly in the U.S. Journalists attributed this to a combination of its simple graphics, satirical marketing campaign, and a lack of market interest in the genre. In the ensuing years, a dedicated fan community spawned that advocated for the series' recognition, particularly after Ness appeared as a playable character in the Super Smash Bros. series. By the 2000s, multiple reader polls and critics had named it one of the greatest video games ever made, and it became regarded as a \"sacred cow among gaming's cognoscenti\". It was followed by the Japan-only sequel Mother 3 for the Game Boy Advance in 2006. EarthBound was later made available worldwide on the Wii U Virtual Console in 2013, 3DS Virtual Console in 2016, the SNES Classic in 2018, and Nintendo Switch Online in February 2022."},{"rank":49,"name":"Diablo II","slug":"diablo-ii","beatInfo":{"main":34,"mainExtra":48,"completionist":187},"imageUrl":"/games/250px-Diablo_II_Coverart.png","summary":"Diablo II is an action role-playing hack-and-slash video game developed by Blizzard North and published by Blizzard Entertainment in 2000 for Microsoft Windows, Classic Mac OS, and macOS. The game, with its dark fantasy and horror themes, was conceptualized and designed by David Brevik and Erich Schaefer, who, with Max Schaefer, acted as project leads on the game. The producers were Matthew Householder and Bill Roper. The game was developed over a 3-year period, with a crunch time of 1.5 years long.Set shortly after the events of Diablo, the player controls a new hero, attempting to stop the destruction unleashed by Diablo's return. The game's 5 acts feature a variety of locations and settings to explore and battle in, as well as an increased cast of characters to play as and interact with.\nBuilding on the success of its predecessor, Diablo (1997), and improving the gameplay, both in terms of updated character progression and a better developed story Diablo II was one of the most popular games of 2000 and has been cited as one of the greatest games of all time. Major factors that contributed to the game's success include its continuation of popular fantasy themes from the previous game and its access to Blizzard's free online play service, Battle.net. An expansion to the game, Diablo II: Lord of Destruction, was released in 2001.Diablo III, the sequel of Diablo II was released on May 15, 2012. Diablo II: Resurrected, a remastered version of Diablo II which also includes the Lord of Destruction expansion, was released on September 23, 2021."},{"rank":48,"name":"StarCraft","slug":"starcraft","beatInfo":{"main":25,"mainExtra":27,"completionist":31},"imageUrl":"/games/250px-StarCraft_box_art.jpg","summary":"StarCraft is a military science fiction media franchise created by Chris Metzen and James Phinney and owned by Blizzard Entertainment. The series, set in the beginning of the 26th century, centers on a galactic struggle for dominance among four species—the adaptable and mobile Terrans, the ever-evolving insectoid Zerg, the powerful and enigmatic Protoss, and the godlike Xel'Naga creator race—in a distant part of the Milky Way galaxy known as the Koprulu Sector. The series debuted with the video game StarCraft in 1998. It has grown to include a number of other games as well as eight novelizations, two Amazing Stories articles, a board game, and other licensed merchandise such as collectible statues and toys.\nBlizzard Entertainment began planning StarCraft in 1995 with a development team led by Metzen and Phinney. The game debuted at the 1996 Electronic Entertainment Expo and used a modified Warcraft II game engine. StarCraft also marked the creation of Blizzard Entertainment's film department; the game introduced high quality cinematics integral to the storyline of the series. Most of the original development team for StarCraft returned to work on the game's expansion pack, Brood War; that game's development began only shortly after StarCraft was released. In 2001, StarCraft: Ghost began development under Nihilistic Software. Unlike the previous real-time strategy games in the series, Ghost was to be a stealth-action game. After three years of development, work on the game was postponed in 2004. Development of a true RTS sequel, StarCraft II: Wings of Liberty, began in 2003; the game was announced in May 2007 and was released in July 2010. StarCraft II continued with the StarCraft II: Heart of the Swarm expansion, which was released in March 2013. The third and final StarCraft II installment, Legacy of the Void, was released in November 2015. In 2016, a single-player nine-mission pack, Nova Covert Ops, was released in form of DLC.The original game and its expansion have been praised as one of the benchmark real-time strategy games of its time. The series has gathered a solid following around the world, particularly in South Korea, where professional players and teams participate in matches, earn sponsorships, and compete in televised matches. By June 2007, StarCraft and Brood War had sold nearly 10 million copies combined. StarCraft 2: Wings of Liberty and its sequels obtained similar praise, and also sold very well. By the end of 2017, the franchise's lifetime revenue totaled over $1 billion. In addition, the series was awarded a star on the Walk of Game in 2006, and holds four Guinness World Records in the Guinness World Records Gamer's Edition of 2008.On March 27, 2017, Blizzard announced StarCraft: Remastered, a remastered version of the original StarCraft, with the core updates being up-to-date graphics and revised dialogue and audio. As of 2017, the original StarCraft, its Brood War expansion, and StarCraft 2: Wings of Liberty are free to download and play from Blizzard's website."},{"rank":47,"name":"World of Warcraft","slug":"world-of-warcraft","beatInfo":{"main":0,"mainExtra":2364,"completionist":2044},"imageUrl":"/games/230px-WoWarcraft_Box_Art1.jpg","summary":"World of Warcraft (WoW) is a massively multiplayer online role-playing game (MMORPG) released in 2004 by Blizzard Entertainment. Set in the Warcraft fantasy universe, World of Warcraft takes place within the world of Azeroth, approximately four years after the events of the previous game in the series, Warcraft III: The Frozen Throne. The game was announced in 2001, and was released for the 10th anniversary of the Warcraft franchise on November 23, 2004. Since launch, World of Warcraft has had eight major expansion packs: The Burning Crusade (2007), Wrath of the Lich King (2008), Cataclysm (2010), Mists of Pandaria (2012), Warlords of Draenor (2014), Legion (2016), Battle for Azeroth (2018), and Shadowlands (2020), with a ninth, Dragonflight, currently in development.\nSimilar to other MMORPGs, the game allows players to create a character avatar and explore an open game world in third- or first-person view, exploring the landscape, fighting various monsters, completing quests, and interacting with non-player characters (NPCs) or other players. The game encourages players to work together to complete quests, enter dungeons and engage in player versus player (PvP) combat, however the game can also be played solo without interacting with others. The game primarily focuses on character progression, in which players earn experience points to level up their character to make them more powerful and buy and sell items using in-game currency to acquire better equipment, among other game systems.\nWorld of Warcraft was a major critical and commercial success upon its original release in 2004 and quickly became the most popular MMORPG of all time, reaching a peak of 12 million subscribers in 2010. The game had over one hundred million registered accounts by 2014 and by 2017, had grossed over $9.23 billion in revenue, making it one of the highest-grossing video game franchises of all time. The game has been cited by gaming journalists as the greatest MMORPG of all time and one of the greatest video games of all time and has also been noted for its long lifespan, continuing to receive developer support and expansion packs over 15 years since its initial release. In 2019, a vanilla version of the game titled World of Warcraft Classic was launched, allowing players to experience the base game before any of its expansions launched. In 2022, Blizzard and NetEase cancelled an unannounced World of Warcraft mobile spin-off game."},{"rank":46,"name":"Star Wars: Knights of the Old Republic","slug":"star-wars-knights-of-the-old-republic","beatInfo":{"main":29,"mainExtra":36,"completionist":47},"imageUrl":"/games/250px-Kotorbox.jpg","summary":"Star Wars: Knights of the Old Republic (KOTOR) is an RPG video game series, based on an earlier comic book series, and with a subsequent new comic book series, all based on the fictional universe of Star Wars by George Lucas. The first title and subsequent MMORPG series were developed by BioWare, while the second was done by Obsidian Entertainment per LucasArts' request. All were published by LucasArts. Both comic series were published by Dark Horse Comics. Both series act as prequels to the video games.\nWith the discontinuation of the Expanded Universe on April 25, 2014, and rebrand as Star Wars Legends, the KotOR multimedia project is the only remaining source of Legends content."},{"rank":45,"name":"Fallout: New Vegas","slug":"fallout-new-vegas","beatInfo":{"main":27,"mainExtra":59.5,"completionist":130},"imageUrl":"/games/Fallout_New_Vegas.jpg","summary":"Fallout: New Vegas is a 2010 action role-playing game developed by Obsidian Entertainment and published by Bethesda Softworks. It was announced in April 2009 and released for Microsoft Windows, PlayStation 3, and Xbox 360 on October 19, 2010. A spin-off of the main Fallout series, the game is set in a post-apocalyptic open world environment that encompasses a region consisting of parts of Arizona, California, and Nevada. It is set in a world that deviated onto an alternate timeline thanks to Atomic Age technology, which eventually led to a global nuclear apocalypse in the year 2077 in an event referred to as \"The Great War\", caused by a major conflict between the U.S. and China over natural resources. The main story of New Vegas takes place in the year 2281, four years after the events of Fallout 3 and 204 years after the bombs fell. It is not a direct sequel, but does feature the return of several elements found in Fallout 2.\nPlayers take control of a character known as the Courier. While transporting a package across the Mojave Desert to the city of New Vegas, what used to be Las Vegas, the Courier is ambushed, robbed of the package, shot, and buried in a cemetery. Ultimately the Courier is dug out and recovers from their wound. The Courier then begins a journey to find their would-be killer and recover the package, makes friends and enemies among various warring factions, and ultimately becomes caught up in a conflict that will determine who controls New Vegas and the Mojave Wasteland. \nNew Vegas received positive reviews, with critics praising the game's writing, quests, and improved gameplay, though it was criticized for its glitches and bugs on launch. It was a commercial success, shipping more than 5 million copies, and is estimated to have sold around 12 million copies worldwide. The game received a Golden Joystick Award for \"RPG of the Year\" in 2011 and was nominated for two BAFTA Awards (Best Strategy Game and Best Story), as well as a NAVGTR Award for Supporting Performance in a Drama (Felicia Day). It has since obtained a cult following, with some critics referring to the game as the best in the Fallout series as well as one of the greatest RPGs of all time."},{"rank":44,"name":"Final Fantasy VI","slug":"final-fantasy-vi","beatInfo":{"main":35,"mainExtra":41.5,"completionist":64},"imageUrl":"/games/3519_Final_Fantasy_VI.jpg","summary":"Final Fantasy VI, also known as Final Fantasy III from its initial North American release, is a 1994 role-playing video game developed and published by Square for the Super Nintendo Entertainment System. It is the sixth main entry in the Final Fantasy series, and the first to be directed by someone other than series creator Hironobu Sakaguchi; the role was instead filled by Yoshinori Kitase and Hiroyuki Ito. Long-time collaborator Yoshitaka Amano returned as character designer and concept artist, while composer Nobuo Uematsu returned to compose the game's score, which has been released on several soundtrack albums.\nSet in a world with technology resembling the Second Industrial Revolution, the game's story follows an expanding cast that includes fourteen permanent playable characters. The narrative deals with the themes of a rebellion against an immoral military dictatorship, pursuit of a magical arms race, use of chemical weapons in warfare, depictions of violent and apocalyptic confrontations, several personal redemption arcs, teenage pregnancy, and the renewal of hope and life itself.\nFinal Fantasy VI received widespread critical acclaim, particularly for its graphics, soundtrack, story, characters, setting, and mature themes, and won numerous awards. It is widely considered to be one of the greatest video games of all time, and is often cited as a watershed title for the role-playing genre. The game was a commercial success, with the Super NES and PlayStation versions selling over 3.48 million copies worldwide by 2003, as well as over 750,000 copies as part of the Japanese Final Fantasy Collection and the North American Final Fantasy Anthology.\nIt was ported by Tose with minor differences to the PlayStation in 1999, and the Game Boy Advance in 2006. The Super NES version was rereleased for the Wii's Virtual Console in 2011, and by Nintendo as part of the company's Super NES Classic Edition in 2017. The game was known as Final Fantasy III when it was first released in North America, as the original Final Fantasy II, Final Fantasy III, and Final Fantasy V had not been released outside Japan at the time (leaving IV as the second title released outside Japan and VI as the third). However, later localizations typically use the original title."},{"rank":43,"name":"Pokémon Yellow","slug":"pokemon-yellow","beatInfo":{"main":27.5,"mainExtra":42,"completionist":79.5},"imageUrl":"/games/250px-Pokemon_Yellow.png","summary":"Pokémon Yellow Version: Special Pikachu Edition, more commonly known as Pokémon Yellow Version or Pokémon Yellow, is a 1998 role-playing video game developed by Game Freak and published by Nintendo for the Game Boy. It is an enhanced version of Pokémon Red and Blue and is part of the first generation of the Pokémon video game series. It was first released in Japan on September 12, 1998, in Australia and North America in 1999 and in Europe in 2000. Along with the release of Pokémon Yellow, a special edition yellow Pokémon-themed Game Boy Color was also released. Pokémon Yellow is loosely based on the anime.\nRemakes of Pokémon Yellow, titled Pokémon: Let's Go, Pikachu! and Let's Go, Eevee!, were released for the Nintendo Switch in 2018, the 20th anniversary of Yellow's release in Japan."},{"rank":42,"name":"Metroid Prime","slug":"metroid-prime","beatInfo":{"main":14,"mainExtra":15.5,"completionist":18.5},"imageUrl":"/games/250px-MetroidPrimebox.jpg","summary":"Metroid Prime is an action-adventure game developed by Retro Studios and published by Nintendo for the GameCube. Metroid Prime is the fifth main installment in the Metroid franchise and the first game in the series to use 3D computer graphics and a first-person perspective. Since exploration takes precedence over combat, Nintendo classifies the game as a \"first-person adventure\" rather than a first-person shooter. It was released in North America in November 2002, and in Japan and Europe the following year. One day before its North American release, Nintendo released the Game Boy Advance game Metroid Fusion, marking the return of the Metroid series after an eight-year hiatus following Super Metroid (1994).Metroid Prime is the first game in the Metroid Prime saga, which takes place between the original Metroid and Metroid II: Return of Samus. Like previous games in the series, Metroid Prime has a science fiction setting in which players control the bounty hunter and series protagonist, Samus Aran. The story follows Samus as she battles the Space Pirates and their biological experiments on the planet Tallon IV. The game was a collaboration between Retro's staff in Austin, Texas, and Japanese Nintendo employees, including producers Shigeru Miyamoto and Kensuke Tanabe, the former of whom suggested the project after visiting Retro's headquarters in 2000.\nThe game garnered universal praise and commercial success, selling over 2.8 million units worldwide. It won a number of Game of the Year awards, and is regarded by many critics and gamers to be one of the greatest video games ever made, remaining one of the highest-rated games on Metacritic. In 2009, an enhanced version was released for the Wii as a stand-alone game in Japan, and as part of the Metroid Prime: Trilogy compilation internationally.\n\n"},{"rank":41,"name":"The Elder Scrolls V: Skyrim","slug":"the-elder-scrolls-v-skyrim","beatInfo":{"main":34,"mainExtra":109,"completionist":232},"imageUrl":"/games/The_Elder_Scrolls_V_Skyrim_cover.png","summary":"The Elder Scrolls V: Skyrim is an action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fifth main installment in the Elder Scrolls series, following 2006's The Elder Scrolls IV: Oblivion, and was released worldwide for Microsoft Windows, PlayStation 3, and Xbox 360 on November 11, 2011.\nThe game is set 200 years after the events of Oblivion, and takes place in Skyrim, the northernmost province of Tamriel. Its main story focuses on the player's character, the Dragonborn, on their quest to defeat Alduin the World-Eater, a dragon who is prophesied to destroy the world. Over the course of the game, the player completes quests and develops the character by improving skills. The game continues the open-world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time, and to ignore or postpone the main storyline indefinitely.\nSkyrim was developed using the Creation Engine, which was rebuilt specifically for the game. The team opted for a unique and more diverse open world than Oblivion's Imperial Province of Cyrodiil, which game director and executive producer Todd Howard considered less interesting by comparison. Upon release, the game received critical acclaim, with praise for its character advancement, world design, visuals, and dual-wielding combat, and is considered by many to be one of the greatest video games ever made. Criticism targeted the melee combat, the dragon battles, and the numerous technical issues present at launch. The game shipped over seven million copies within the first week of its release, and sold 30 million copies on all platforms by 2016, making it one of the best-selling video games in history.\nThree downloadable content (DLC) add-ons were released separately—Dawnguard, Hearthfire and Dragonborn—which were bundled along with the base game into The Elder Scrolls V: Skyrim – Legendary Edition and released in June 2013. A remastered version, titled The Elder Scrolls V: Skyrim – Special Edition, was released for Windows, PlayStation 4 and Xbox One in October 2016, with all three DLC expansions and a graphical upgrade. A port for the Nintendo Switch was released in November 2017. A separate VR-only version, titled The Elder Scrolls V: Skyrim VR, was released in November 2017 for PlayStation 4 using PlayStation VR, and for Windows-based VR headsets in April 2018. In addition, the Special Edition was released on PlayStation 5 and Xbox Series X/S as part of the compilation The Elder Scrolls V: Skyrim – Anniversary Edition in November 2021."},{"rank":40,"name":"Resident Evil 4","slug":"resident-evil-4","beatInfo":{"main":15.5,"mainExtra":20,"completionist":30.5},"imageUrl":"/games/250px-Resi4-gc-cover.jpg","summary":"Resident Evil 4 is a survival horror third-person shooter game developed by Capcom Production Studio 4 and published by Capcom. It was originally released for the GameCube on January 11, 2005. Players control U.S. government special agent Leon S. Kennedy, who is sent on a mission to rescue the U.S. president's daughter Ashley Graham, who has been kidnapped by a cult. In rural Spain, Leon fights hordes of villagers infected by a mind-controlling parasite and reunites with the spy Ada Wong.\nDevelopment began for PlayStation 2 in 1999. Four proposed versions were discarded; the first attempt was directed by Hideki Kamiya. In a departure from the fixed camera angles and slower survival horror gameplay of previous Resident Evil games, the team focused on developing more dynamic shooting action.\nResident Evil 4 was announced as a GameCube exclusive as part of the Capcom Five, but was ported to numerous formats; it became a cross-platform hit, selling more than 11 million copies across several platforms. It garnered universal acclaim for its story, gameplay, graphics, voice acting, and characters, and is often named one of the best video games ever made, winning multiple Game of the Year awards in 2005. It influenced the evolution of the survival horror and third-person genres, popularizing the \"over-the-shoulder\" third-person view. \nA sequel, Resident Evil 5, was released in 2009. A remake of Resident Evil 4 is set for release in 2023 for PlayStation 5, Xbox Series X/S, and Windows."},{"rank":39,"name":"Shadow of the Colossus","slug":"shadow-of-the-colossus","beatInfo":{"main":7,"mainExtra":9,"completionist":25},"imageUrl":"/games/52731_Shadow_of_the_Colossus_(2018).jpg","summary":"Shadow of the Colossus is a 2005 action-adventure game developed by Japan Studio and Team Ico, and published by Sony Computer Entertainment for the PlayStation 2. It takes place in a fantasy setting and follows Wander, a young man who enters an isolated and abandoned region of the realm seeking the power to revive a girl named Mono. The player assumes the role of Wander as he embarks on a mission that might entail Mono's resurrection: to locate and destroy the colossi, sixteen massive beings spread across the forbidden land, which the protagonist traverses by horseback and on foot.\nThe game was directed by Fumito Ueda and developed at Sony Computer Entertainment's International Production Studio 1, also known as Team Ico, the same development team responsible for the acclaimed PlayStation 2 title Ico, to which the game is considered a spiritual successor. Сonceived as an online multiplayer game titled NICO directly after Ico's completion, Shadow of the Colossus underwent a lengthy production cycle during which it was redeveloped as a single-player title. The team sought to create an outstanding interactive experience by including a distinct visual design, an unorthodox gameplay template, and non-player characters with sophisticated artificial intelligence such as the colossi and Wander's horse, Agro.\nCited as an influential title in the video game industry and one of the best video games ever made, Shadow of the Colossus is often regarded as an important example of video game as art due to its minimalist landscape designs, immersive gameplay, and emotional rendition of the player character's journey. It received wide critical acclaim by the media and was met with strong sales compared to Ico, due in part to a larger marketing campaign. The game won several awards for its audio, design, and overall quality. A remastered version for the PlayStation 3 was released alongside Ico as The Ico & Shadow of the Colossus Collection in September 2011, developed by Bluepoint Games, who later produced a high definition remake of Shadow of the Colossus for the PlayStation 4 in 2018.\n\n"},{"rank":38,"name":"The Last of Us Part 2","slug":"the-last-of-us-part-2","beatInfo":{"main":0,"mainExtra":0,"completionist":0},"imageUrl":"","summary":"The Last of Us Part II is a 2020 action-adventure game developed by Naughty Dog and published by Sony Interactive Entertainment for the PlayStation 4. Set five years after The Last of Us (2013), the game focuses on two playable characters in a post-apocalyptic United States whose lives intertwine: Ellie, who sets out for revenge after suffering a tragedy, and Abby, a soldier who becomes involved in a conflict between her militia and a religious cult. The game is played from a third-person perspective and allows the player to fight human enemies and cannibalistic zombie-like creatures with firearms, improvised weapons, and stealth.\nDevelopment of The Last of Us Part II began in 2014, soon after the release of The Last of Us Remastered. Neil Druckmann returned as creative director, co-writing the story with Halley Gross. The themes of revenge and retribution were inspired by Druckmann's experiences growing up in Israel. Ashley Johnson reprises her role as Ellie, while Laura Bailey was cast as Abby. Their performances included the simultaneous recording of motion and voice. The developers pushed the technical capabilities of the PlayStation 4 during development. Gustavo Santaolalla returned to compose and perform the game's score. Development reportedly included a crunch schedule of 12-hour workdays.\nFollowing some delays, partly due to the COVID-19 pandemic, The Last of Us Part II was released on June 19, 2020. It received critical acclaim, with praise for its gameplay, audio design, score, performances, characters, and visual fidelity, though its narrative and themes divided critics. It was the subject of review bombing on Metacritic, with some player criticism directed at particular scenes, chapters, and characters; discourse surrounding the game became adversarial. Part II is one of the best-selling PlayStation 4 games and the fastest-selling PlayStation 4 exclusive, with over four million units sold in its release weekend, and over ten million by 2022. It holds the record for most Game of the Year awards, and received multiple other accolades from awards shows and gaming publications."},{"rank":37,"name":"Red Dead Redemption","slug":"red-dead-redemption","beatInfo":{"main":18,"mainExtra":27,"completionist":46.5},"imageUrl":"/games/256px-Red_Dead_Redemption.jpg","summary":"Red Dead Redemption is a 2010 action-adventure game developed by Rockstar San Diego and published by Rockstar Games. A spiritual successor to 2004's Red Dead Revolver, it is the second game in the Red Dead series. Red Dead Redemption is set during the decline of the American frontier in the year 1911 and follows John Marston, a former outlaw whose wife and son are taken hostage by the government in ransom for his services as a hired gun. Having no other choice, Marston sets out to bring three members of his former gang to justice.\nThe game is played from a third-person perspective. The player may freely roam in its interactive open world, a fictionalized version of the Western United States and Northern Mexico, primarily by horseback and on foot. Gunfights emphasize a gunslinger gameplay mechanic called \"Dead Eye\" that allows players to mark multiple shooting targets on enemies in slow motion. The game makes use of a morality system, by which the player's actions in the game affect their character's levels of honor and fame and how other characters respond to the player. An online multiplayer mode is included with the game, allowing up to 16 players to engage in both cooperative and competitive gameplay in a recreation of the single-player setting.\nThe game's development lasted over five years, and it became one of the most expensive video games ever made. Rockstar improved its proprietary game engine to increase its technological capabilities. The development team conducted extensive research, visiting historical American landmarks and analyzing classic Western films, to achieve realism while creating the game. The team hired professional actors to perform the body movements through motion capture. Red Dead Redemption features an original score composed by Bill Elm and Woody Jackson. The game's development received controversy following accusations of unethical working practices. The working hours and managerial style of the studio was met with public complaints from staff members.\nRed Dead Redemption was released for the PlayStation 3 and Xbox 360 in May 2010. It received critical acclaim for its visuals, music, performances, gameplay, and narrative. It won several year-end accolades, including Game of the Year awards from several gaming publications, and is considered by critics as one of the best video games ever made. It had shipped around 23 million copies by 2021, making it one of the best-selling video games. After the game's release, several downloadable content additions were released; Undead Nightmare, later released as a standalone game, added a new single-player campaign in which Marston searches for a cure for an infectious zombie plague. A prequel, Red Dead Redemption 2, was released in October 2018."},{"rank":36,"name":"Metal Gear Solid","slug":"metal-gear-solid","beatInfo":{"main":11.5,"mainExtra":13,"completionist":16},"imageUrl":"/games/252px-Metal_Gear_Solid_cover_art.png","summary":"Metal Gear (Japanese: メタルギア, Hepburn: Metaru Gia) is a series of techno-thriller stealth games created by Hideo Kojima. Developed and published by Konami, the first game, Metal Gear, was released in 1987 for MSX home computers. The player often takes control of a special forces operative (usually Solid Snake or Big Boss), who is assigned the task of finding the titular superweapon \"Metal Gear\", a bipedal walking tank with the ability to launch nuclear weapons.\nSeveral sequels have been released for multiple consoles, which have expanded the original game's plot, adding characters opposing and supporting Snake, while several prequels have explored the origins of Metal Gear and recurring characters. The third game in the series, Metal Gear Solid for the PlayStation, marked a transition to 3D graphics and gained the series international fame. It was ported two years later by Microsoft Game Studios to Windows, marking the franchise's debut on the platform. As of December 2021, 58 million copies of games in the franchise have been sold worldwide, with individual installments critically and commercially acclaimed and receiving several awards.\nThe series is credited for pioneering and popularizing stealth video games and \"cinematic video games\". Notable traits of the series include cinematic cutscenes, intricate storylines, offbeat and fourth wall humour, and exploration of cyberpunk, dystopian, political and philosophical themes, with references to Hollywood films to add flavor. The franchise has also been adapted into other media, such as comics, novels, and drama CDs. Solid Snake has also gone on to appear in other games, such as the Super Smash Bros. series, Ape Escape 3, and LittleBigPlanet."},{"rank":35,"name":"Sid Meier's Civilization IV","slug":"sid-meiers-civilization-iv","beatInfo":{"main":11.5,"mainExtra":40.5,"completionist":115},"imageUrl":"/games/256px-CivIVboxshot.jpg","summary":"Civilization IV (also known as Sid Meier's Civilization IV) is a 4X turn-based strategy computer game and the fourth installment of the Civilization series, and designed by Soren Johnson under the direction of Sid Meier and his video game development studio Firaxis Games. It was released in North America, Europe, and Australia, between October 25 and November 4, 2005, and followed by Civilization V.\nCivilization IV uses the 4X empire-building model for turn-based strategy gameplay, in which the player's main objective is to construct a civilization from limited initial resources. Most standard full-length games start the player with a settler unit and/or a city unit in the year 4000 BC. As with other games in the series, there are by default five objectives the player can pursue in order to finish the game: conquering all other civilizations, controlling a supermajority of the game world's land and population, building and sending the first sleeper ship to the Alpha Centauri star system, increasing the \"Culture ratings\" of at least three different cities to \"legendary\" levels, or winning a \"World Leader\" popularity contest by the United Nations. If the time limit for the game is reached and none of the previous goals has been fulfilled by any players including game AI players, the civilization with the highest total game score is declared winner. A large departure from earlier Civilization games is a new graphics engine created from scratch, based on the Gamebryo engine by Numerical Design Limited (NDL).\nThe game has received critical acclaim and was hailed as an exemplary product of one of the leading video game producers in the turn-based strategy genre, and has been listed as one of the best video games of all time. Civilization IV sold over 3 million copies by 2008 and won multiple awards, including several Game of the Year awards. Its title song, \"Baba Yetu\", was the first piece of video game music to win a Grammy Award. Two major expansions were released, Civilization IV: Warlords and Civilization IV: Beyond the Sword, as well as the stand-alone expansion pack Civilization IV: Colonization, which were all combined in 2009 into one release edition titled Sid Meier's Civilization IV: The Complete Edition."},{"rank":34,"name":"The Legend of Zelda: Ocarina of Time","slug":"the-legend-of-zelda-ocarina-of-time","beatInfo":{"main":26.5,"mainExtra":30.5,"completionist":39},"imageUrl":"/games/250px-ZeldaOoTbox.png","summary":"The Legend of Zelda: Ocarina of Time is an action-adventure game developed and published by Nintendo for the Nintendo 64. It was released in Japan and North America in November 1998, and in PAL regions the following month. Ocarina of Time is the first game in The Legend of Zelda series with 3D graphics.\nIt was developed by Nintendo EAD, led by five directors including Eiji Aonuma and Yoshiaki Koizumi, produced by series co-creator Shigeru Miyamoto, and written by Kensuke Tanabe. Veteran Zelda series composer Koji Kondo created the musical score. The player controls Link in the fantasy land of Hyrule on a quest to stop the evil king Ganondorf, by traveling through time and navigating dungeons and an overworld. The game introduced features such as a target-lock system and context-sensitive buttons that have since become common in 3D adventure games. The player must learn to play numerous songs on an ocarina to progress.\nOcarina of Time received widespread acclaim from critics and consumers and won several awards and accolades, who praised its visuals, sound, gameplay, soundtrack, and writing. It has been ranked by numerous publications as the greatest video game of all time, and is the highest-rated game of all time on the review aggregator Metacritic. It was commercially successful, with more than seven million copies sold worldwide. In the United States, it received more than three times more pre-orders than any other video game at the time, and was the best-selling game of 1998 in the country.\nA direct sequel, The Legend of Zelda: Majora's Mask, was released in 2000. Ocarina of Time has been re-released on every one of Nintendo's home consoles since and on the iQue Player in China. An enhanced version of the game for the Nintendo 3DS, The Legend of Zelda: Ocarina of Time 3D, was released in 2011. Master Quest, an alternative version of the game including new puzzles and increased difficulty, is included in one of the GameCube releases and the 3D version."},{"rank":33,"name":"Minecraft","slug":"minecraft","beatInfo":{"main":132,"mainExtra":341,"completionist":380},"imageUrl":"/games/256px-Minecraft_1.1_Title.png","summary":"Minecraft is a sandbox video game developed by Mojang Studios. The game was created by Markus \"Notch\" Persson in the Java programming language. Following several early private testing versions, it was first made public in May 2009 before being fully released in November 2011, with Notch stepping down and Jens \"Jeb\" Bergensten taking over development. Minecraft has since been ported to several other platforms and is the best-selling video game of all time, with over 238 million copies sold and nearly 140 million monthly active users as of 2021.\nIn Minecraft, players explore a blocky, procedurally generated 3D world with virtually infinite terrain and may discover and extract raw materials, craft tools and items, and build structures, earthworks, and simple machines. Depending on game mode, players can fight computer-controlled mobs, as well as cooperate with or compete against other players in the same world. Game modes include a survival mode (in which players must acquire resources to build the world and maintain health) and a creative mode (where players have unlimited resources and access to flight). Players can modify the game to create new gameplay mechanics, items, and assets.\nMinecraft received critical acclaim, winning several awards and later being cited as one of the greatest video games of all time. Social media, parodies, adaptations, merchandise, and the annual Minecon conventions played prominent roles in popularizing the game. The game has also been used in educational environments to teach chemistry, computer-aided design, and computer science. In 2014, Mojang and the Minecraft intellectual property were purchased by Microsoft for US$2.5 billion. Several spin-offs have also been made, including Minecraft: Story Mode (which has since been shut down on all platforms except Netflix, where only the first five episodes are available), Minecraft Dungeons, Minecraft Earth (which has since also been shut down), and—in 2023—Minecraft Legends.\n\n"},{"rank":32,"name":"Halo: Combat Evolved","slug":"halo-combat-evolved","beatInfo":{"main":10,"mainExtra":11,"completionist":13.5},"imageUrl":"/games/Halobox.jpg","summary":"Halo: Combat Evolved is a 2001 first-person shooter game developed by Bungie and published by Microsoft Game Studios. It was released as a launch game for Microsoft's Xbox video game console on November 15, 2001. The game was ported to Microsoft Windows and Mac OS X in 2003. It was later released as a downloadable Xbox Original for the Xbox 360. Halo is set in the twenty-sixth century, with the player assuming the role of the Master Chief, a cybernetically enhanced supersoldier. The Chief is accompanied by Cortana, an artificial intelligence. Players battle aliens as they attempt to uncover the secrets of the eponymous Halo, a ring-shaped artificial world.\nBungie began the development of what would eventually become Halo CE in 1997. Initially, the game was a real-time strategy game that morphed into a third-person shooter before becoming a first-person shooter. During development, Microsoft acquired Bungie and turned Halo into a launch game for its first video game console, the Xbox.  \nHalo was a critical and commercial success and is often praised as one of the greatest video games ever made. The game's popularity led to labels such as \"Halo clone\" and \"Halo killer\", applied to games either similar to or anticipated to be better than it. Its sequel, Halo 2, was released for the original Xbox in 2004, and the game spawned a multi-billion-dollar multimedia franchise that incorporates games, books, toys, and films. The game inspired and was used in the fan-created Red vs. Blue video series, which is credited as one of the first major successes of machinima (the technique of using real-time 3D engines, often from video games, to create animated films). \nMore than six million copies had been sold worldwide by November 2005. A remake of the game's campaign, Halo: Combat Evolved Anniversary, was released for Xbox 360 by 343 Industries on the 10th anniversary of the original game's launch. Anniversary was re-released alongside the original competitive multiplayer as part of Halo: The Master Chief Collection in 2014."},{"rank":31,"name":"Half-Life","slug":"half-life","beatInfo":{"main":12,"mainExtra":14,"completionist":15.5},"imageUrl":"/games/256px-Half-Life_Cover_Art.jpg","summary":"Half-life is a mathematical and scientific description of exponential or gradual decay.\nHalf-life, half life or halflife may also refer to:"},{"rank":30,"name":"Final Fantasy XIV","slug":"final-fantasy-xiv","beatInfo":{"main":234,"mainExtra":1660,"completionist":120},"imageUrl":"/games/Final_Fantasy_XIV,_A_Realm_Reborn_box_cover.jpg","summary":"Final Fantasy XIV is a massively multiplayer online role-playing game (MMORPG) developed and published by Square Enix. Directed and produced by Naoki Yoshida, it was released worldwide for Microsoft Windows and PlayStation 3 in August 2013, as a replacement for the failed 2010 version of the game, with support for PlayStation 4, PlayStation 5, and macOS releasing later. Final Fantasy XIV takes place in the fictional land of Eorzea, five years after the events of the original 2010 release. At the conclusion of the original game, the primal dragon Bahamut escapes from its lunar prison to initiate the Seventh Umbral Calamity, an apocalyptic event which destroys much of Eorzea. Through the gods' blessing, the player character escapes the devastation by time traveling five years into the future. As Eorzea recovers and rebuilds, the player must deal with the impending threat of invasion by the Garlean Empire from the north.\nThe original Final Fantasy XIV, released in September 2010, was a commercial and critical failure. In response, then-Square Enix President Yoichi Wada announced that a new team, led by Yoshida, would take over and attempt to fix the issues with it. This team was responsible for generating content for the original version as well as developing a brand new game which would address all of the previous release's criticisms. This new game, initially dubbed \"Version 2.0\", features a new game engine, improved server infrastructure, and revamped gameplay, interface, and story. The original version shut down in November 2012 and was followed by an alpha test for Version 2.0.\nThe game released to largely positive reception; critics praised the game for its solid mechanics and progression, and they commended Yoshida for turning the project around. After a poor 2013 fiscal year, Square Enix executives attributed the company's 2014 return to profitability in part to the game's strong sales and subscriber base, reaching a total of over 24 million registered players by October 2021, also becoming the most profitable Final Fantasy game to date. The game has had a number of post-release updates produced for it, including four major expansion packs: Heavensward (2015), Stormblood (2017), Shadowbringers (2019), and Endwalker (2021)."},{"rank":29,"name":"Doom","slug":"doom","beatInfo":{"main":11.5,"mainExtra":16,"completionist":26.5},"imageUrl":"/games/doom_2016.jpg","summary":"Doom is another name for damnation.\nDoom may also refer to:\n\n"},{"rank":28,"name":"Tetris","slug":"tetris","beatInfo":{"main":4,"mainExtra":5,"completionist":12},"imageUrl":"/games/NES_Tetris_Box_Front.jpg","summary":"Tetris (Russian: Тетрис) is a puzzle video game created by Soviet software engineer Alexey Pajitnov in 1984. It has been published by several companies for multiple platforms, most prominently during a dispute over the appropriation of the rights in the late 1980s. After a significant period of publication by Nintendo, the rights reverted to Pajitnov in 1996, who co-founded the Tetris Company with Henk Rogers to manage licensing.\nIn Tetris, players complete lines by moving differently shaped pieces (tetrominoes), which descend onto the playing field. The completed lines disappear and grant the player points, and the player can proceed to fill the vacated spaces. The game ends when the uncleared lines reach the top of the playing field. The longer the player can delay this outcome, the higher their score will be. In multiplayer games, players must last longer than their opponents; in certain versions, players can inflict penalties on opponents by completing a significant number of lines. Some versions add variations on the rules, such as three-dimensional displays or a system for reserving pieces.\nBuilt on simple rules and requiring intelligence and skill, Tetris established itself as one of the great early video games. By December 2011, it had sold 202 million copies – approximately 70 million physical units and 132 million paid mobile game downloads – making it one of the best-selling video game franchises of all time. The Game Boy version is one of the best-selling games of all time, with more than 35 million copies sold. Tetris is available on over 65 platforms, setting a Guinness world record for the most ported video game. Tetris is rooted within popular culture and its popularity extends beyond the sphere of video games; imagery from the game has influenced architecture, music and cosplay. The game has also been the subject of various research studies that have analyzed its theoretical complexity and have shown its effect on the human brain following a session, in particular the Tetris effect."},{"rank":27,"name":"Metal Gear Solid 3: Snake Eater","slug":"metal-gear-solid-3-snake-eater","beatInfo":{"main":16,"mainExtra":19.5,"completionist":24},"imageUrl":"/games/250px-Mgs3box.jpg","summary":"Metal Gear Solid 3: Snake Eater is a 2004 stealth game developed by Konami Computer Entertainment Japan and published by Konami. It was released in late 2004 in North America and Japan, then in early 2005 in Europe and Australia, originally for the PlayStation 2. It was the fifth Metal Gear game written and directed by Hideo Kojima and serves as a prequel to the entire Metal Gear series. An expanded edition, titled Metal Gear Solid 3: Subsistence, was released in Japan in late 2005, then in North America, Europe and Australia in 2006. A remastered version of the game was later included in the Metal Gear Solid HD Collection for the PlayStation 3, PlayStation Vita and Xbox 360, while a reworked version, titled Metal Gear Solid: Snake Eater 3D, was released for the Nintendo 3DS in 2012.\nSet in 1964, 31 years before the events of the original Metal Gear, the story centers on the FOX operative codenamed Naked Snake as he attempts to rescue Russian rocket scientist Nikolai Stepanovich Sokolov, sabotage an experimental superweapon, and assassinate his defected former boss. While previous games were set in a primarily urban environment, Snake Eater adopts a 1960s Soviet jungle setting, with the high tech, near-future trappings of previous Metal Gear Solid games replaced with wilderness. While the environment has changed, the game's focus remains on stealth and infiltration, while retaining the series' self-referential, fourth-wall-breaking sense of humor. The story of Snake Eater is told through numerous cutscenes and radio conversations.\nConsidered one of the greatest video games of all time, Metal Gear Solid 3 was met with critical acclaim and was a commercial success, having sold more than four million copies worldwide as of March 2010."},{"rank":26,"name":"Half-Life: Alyx","slug":"half-life-alyx","beatInfo":{"main":12,"mainExtra":14,"completionist":18.5},"imageUrl":"/games/72067_Half-Life_Alyx.jpg","summary":"Half-Life: Alyx is a 2020 virtual reality (VR) first-person shooter developed and published by Valve. It was released for Windows and Linux with support for most PC-compatible VR headsets. Set five years before Half-Life 2 (2004), players control Alyx Vance on a mission to seize a superweapon belonging to the alien Combine. Like previous Half-Life games, Alyx incorporates combat, puzzles, exploration and survival horror. Players use VR to interact with the environment and fight enemies, using \"gravity gloves\" to snatch objects from a distance, similarly to the gravity gun from Half-Life 2. \nThe previous Half-Life game, Episode Two, was released in 2007 and ended on a cliffhanger. Valve made several attempts to develop further Half-Life games, but could not settle on a direction. In the mid-2010s, Valve began experimenting with VR. Recognizing the demand for a major VR game, they experimented with prototypes using their various intellectual properties such as Portal, and found that Half-Life best suited VR. \nHalf-Life: Alyx entered production using Valve's new Source 2 engine in 2016, with the largest team in Valve's history, including members of Campo Santo, a studio Valve acquired in 2018. VR affected almost every aspect of the design, including combat, movement, level design, and pacing. Valve initially planned to launch Alyx alongside its Index VR headset in 2019, but delayed it following internal feedback about the story by their new writer, Rob Yescombe; Erik Wolpaw and Jay Pinkerton rejoined Valve to rewrite it. \nHalf-Life: Alyx received acclaim for its graphics, voice acting, narrative, and atmosphere, and has been cited as VR's first killer app. It was nominated for numerous awards and won \"Best VR/AR\" at the 2020 Game Awards. It attracted a large number of players on the day of release compared to other VR games, though Valve acknowledged that the VR audience was limited. Gabe Newell, the president of Valve, described Alyx as a long-term investment into new technologies."},{"rank":25,"name":"God of War","slug":"god-of-war","beatInfo":{"main":20.5,"mainExtra":32.5,"completionist":51},"imageUrl":"/games/38050_God_of_War.jpg","summary":"A god of war is a deity associated with war.\nGod of War or Gods of War may also refer to:\n\n"},{"rank":24,"name":"Chrono Trigger","slug":"chrono-trigger","beatInfo":{"main":23,"mainExtra":26.5,"completionist":42.5},"imageUrl":"/games/Chrono_Trigger.jpg","summary":"Chrono Trigger is a 1995 role-playing video game developed and published by Square. It was originally released for the Super Nintendo Entertainment System as the first game in the Chrono series. The game's development team included three designers that Square dubbed the \"Dream Team\": Hironobu Sakaguchi, creator of Square's Final Fantasy series; Yuji Horii, creator of Enix's Dragon Quest series; and Akira Toriyama, character designer of Dragon Quest and author of the Dragon Ball manga series. In addition, Takashi Tokita co-directed the game and co-wrote the scenario, Kazuhiko Aoki produced the game, Masato Kato wrote most of the story, while composer Yasunori Mitsuda wrote most of the soundtrack before falling ill and deferring the remaining tracks to Final Fantasy series composer Nobuo Uematsu. The game's story follows a group of adventurers who travel through time to prevent a global catastrophe.\nChrono Trigger was a critical and commercial success upon release and is frequently cited as one of the greatest video games of all time. Nintendo Power magazine described aspects of the game as revolutionary, including its multiple endings, plot-related side-quests focusing on character development, unique battle system, and detailed graphics. Chrono Trigger was the second best-selling game of 1995 in Japan, and shipped 2.65 million copies worldwide by March 2003. Excluding the PC version, the game had shipped over 3.5 million copies worldwide by February 2018.\nSquare released a ported version by Tose in Japan for the PlayStation in 1999, which was later repackaged with a Final Fantasy IV port as Final Fantasy Chronicles (2001) for the North American market. A slightly enhanced Chrono Trigger, again ported by Tose, was released for the Nintendo DS in North America and Japan in 2008, and PAL regions in 2009. The game has also been ported to i-mode, the Virtual Console, the PlayStation Network, iOS, Android, and Windows."},{"rank":23,"name":"Portal","slug":"portal","beatInfo":{"main":3,"mainExtra":5,"completionist":9.5},"imageUrl":"/games/256px-Portal_standalonebox.jpg","summary":"Portal often refers to:\n\nPortal (architecture), an opening in a wall of a building, gate or fortification, or the extremities (ends) of a tunnelPortal may also refer to:"},{"rank":22,"name":"Street Fighter II","slug":"street-fighter-ii","beatInfo":{"main":1.5,"mainExtra":7.5,"completionist":11},"imageUrl":"/games/9640-streetfighter-ii-wii_large.jpg","summary":"Street Fighter II: The World Warrior is a fighting game developed by Capcom and originally released for arcades in 1991. It is the second installment in the Street Fighter series and the sequel to 1987's Street Fighter. It is Capcom's fourteenth game to use the CP System arcade system board. Street Fighter II improved many of the concepts introduced in the first game, including the use of special command-based moves, a combo system, a six-button configuration, and a wider selection of playable characters, each with a unique fighting style. \nIt prominently features a popular two-player mode that obligates direct, human-to-human competitive play which prolonged the survival of the declining video game arcade business market by stimulating business and driving the fighter genre. It inspired grassroots tournament events, culminating into Evolution Championship Series (EVO). Street Fighter II shifted the arcade competitive dynamic from achieving personal-best high scores to head-to-head competition, including large groups.Street Fighter II became the best-selling game since the golden age of arcade video games. By 1994, it had been played by at least 25 million people in the United States alone. Due to its major success, a series of updated versions was released with additional features and characters. Worldwide, more than 200,000 arcade cabinets and 15 million software units of all versions of Street Fighter II have been sold, grossing an estimated $10 billion in total revenue, making it one of the top three highest-grossing video games of all time as of 2017 and the best-selling fighting game until 2019. More than 6.3 million SNES cartridges of Street Fighter II have been sold, making it Capcom's best-selling single software game for the next two decades, its best-selling game on a single platform, and the highest-selling third-party game on the SNES.\nStreet Fighter II is regarded as one of the greatest video games of all time and the most important and influential fighting game ever made. Its launch is seen as a revolutionary moment within its genre, credited with popularizing the fighting genre during the 1990s and inspiring other producers to create their own fighting series. It sparked a renaissance for the arcade video game industry and impacted competitive video gaming and wider popular culture such as films and music."},{"rank":21,"name":"Super Mario Bros.","slug":"super-mario-bros","beatInfo":{"main":2,"mainExtra":2,"completionist":2},"imageUrl":"/games/250px-Super_Mario_Bros._box.png","summary":"Super Mario Bros. is a platform game developed and published by Nintendo for the Nintendo Entertainment System. The successor to the 1983 arcade game Mario Bros. and the first game in the Super Mario series, it was released in 1985 for the Famicom in Japan. Following a limited US release for the Nintendo Entertainment System (NES), it was ported to international arcades for the Nintendo Vs. System in early 1986. The NES version received a wide release in North America that year and in PAL regions in 1987.\nPlayers control Mario, or his brother Luigi in the multiplayer mode, as they traverse the Mushroom Kingdom to rescue Princess Toadstool from King Koopa (later named Bowser). They traverse side-scrolling stages while avoiding hazards such as enemies and pits with the aid of power-ups such as the Super Mushroom, Fire Flower, and Starman.\nThe game was designed by Shigeru Miyamoto and Takashi Tezuka as \"a grand culmination\" of the Famicom team's three years of game mechanics and programming, drawing from their experiences working on Devil World and the side-scrollers Excitebike and Kung Fu to advance their previous work on platforming \"athletic games\" such as Donkey Kong and Mario Bros. The design of the first level, World 1-1, serves as a tutorial for platform gameplay.\nSuper Mario Bros. is frequently cited as one of the greatest video games of all time, with praise for its precise controls. It is one of the best-selling games of all time, with more than 58 million copies sold worldwide. It is credited alongside the NES as one of the key factors in reviving the video game industry after the 1983 crash, and helped popularize the side-scrolling platform game genre. Koji Kondo's soundtrack is one of the earliest and most popular in video games, making music a centerpiece of game design. The game began a multimedia franchise including a long-running game series, an animated television series, a live-action feature film and an upcoming animated feature film. It has been re-released on most Nintendo systems. Mario and Super Mario Bros. have become prominent in popular culture."},{"rank":20,"name":"Undertale","slug":"undertale","beatInfo":{"main":6.5,"mainExtra":10.5,"completionist":21},"imageUrl":"/games/Undertale_header.jpg","summary":"Undertale is a 2015 2D role-playing video game created by American indie developer Toby Fox. The player controls a child who has fallen into the Underground: a large, secluded region under the surface of the Earth, separated by a magical barrier. The player meets various monsters during the journey back to the surface, although some monsters might engage the player in a fight. The combat system involves the player navigating through mini-bullet hell attacks by the opponent. They can opt to pacify or subdue monsters in order to spare them instead of killing them. These choices affect the game, with the dialogue, characters, and story changing based on outcomes.\nOutside of artwork and character designs by Temmie Chang, Fox developed the entirety of the game by himself, including the script and music. The game took inspiration from several sources, including the Brandish, Mario & Luigi, and Mother role-playing game series, bullet hell shooter series Touhou Project, role-playing game Moon: Remix RPG Adventure, and British comedy show Mr. Bean. Originally, Undertale was meant to be two hours in length and was set to be released in mid-2014. However, development was delayed over the next three years.\nThe game was released for Microsoft Windows and OS X in September 2015. It was also ported to Linux in July 2016, PlayStation 4 and PlayStation Vita in August 2017, the Nintendo Switch in September 2018, and Xbox One in March 2021. The game was acclaimed for its thematic material, intuitive combat system, musical score, originality, story, dialogue, and characters. The game sold over one million copies and was nominated for multiple accolades and awards. Several gaming publications and conventions listed Undertale as game of the year, and others have since listed it as one of the greatest video games. Two chapters of a related game, Deltarune, were released in 2018 and 2021."},{"rank":19,"name":"Bloodborne","slug":"bloodborne","beatInfo":{"main":33.5,"mainExtra":43.5,"completionist":75.5},"imageUrl":"/games/Bloodborne_Cover_Wallpaper.jpg","summary":"Bloodborne is a 2015 action role-playing game developed by FromSoftware and published by Sony Computer Entertainment for the PlayStation 4. Bloodborne follows the player's character, a Hunter, through the decrepit Gothic, Victorian-era–inspired city of Yharnam, whose inhabitants are afflicted with a blood-borne disease. Attempting to find the source of the plague, the player's character unravels the city's mysteries while fighting beasts and cosmic beings.\nThe game is played from a third-person perspective. Players control a customizable protagonist, and the gameplay is focused on strategic weapons-based combat and exploration. Players battle varied enemies while using items such as swords and firearms, exploring different locations, interacting with non-player characters, and unravelling the city's mysteries. Bloodborne began development in 2012 under the working title of Project Beast. Bearing many similarities to the Souls series of games by the same developer and director, Bloodborne was inspired by the literary works of authors H. P. Lovecraft and Bram Stoker and the architectural design of real-world locations in countries such as Romania, the Czech Republic and Scotland.\nBloodborne was released in March 2015 and received critical acclaim, with praise directed at its gameplay, particularly its high difficulty level, atmosphere, sound design, Lovecraftian themes, and interconnected world design. Some criticism was directed at its technical performance at launch, which was improved with post-release updates. An expansion adding additional content, The Old Hunters, was released in November 2015. By the end of 2015, the game had sold over two million copies worldwide. Bloodborne won several awards and has been cited as one of the greatest video games ever made. Some related media and adaptations have also been released, including a card game, board game and comic book series."},{"rank":18,"name":"BioShock","slug":"bioshock","beatInfo":{"main":12,"mainExtra":15.5,"completionist":22},"imageUrl":"/games/Bioshockcoverfinalcropped.jpg","summary":"BioShock is a 2007 first-person shooter game developed by 2K Boston (later Irrational Games) and 2K Australia, and published by 2K Games. The first game in the BioShock series, it was released for Microsoft Windows and Xbox 360 platforms in August 2007; a PlayStation 3 port by Irrational, 2K Marin, 2K Australia and Digital Extremes was released in October 2008. The game is set in 1960, and follows Jack who discovers the underwater city of Rapture. Built by business magnate Andrew Ryan to be an isolated utopia, the discovery of ADAM, a genetic material which grants superhuman powers, initiated the city's turbulent decline. Jack attempts to escape, fighting ADAM-obsessed enemies and Big Daddies, while engaging with the few sane humans that remain and learning of Rapture's past. The player, as Jack, can defeat foes in several ways by using weapons, utilizing plasmids that give unique powers, and by turning Rapture's defenses against them.\nBioshock's concept was developed by Irrational's creative lead, Ken Levine, and incorporates ideas by 20th century dystopian and utopian thinkers such as Ayn Rand, George Orwell, and Aldous Huxley, as well as historical figures such as John D. Rockefeller, Jr. and Walt Disney. The game includes elements of role-playing games, giving the player different approaches in engaging enemies such as by stealth, as well as moral choices of saving or killing characters. Additionally, the game and its biopunk theme borrow concepts from the survival horror genre, notably the Resident Evil series. Bioshock is considered a spiritual successor to the System Shock series, on which many of Irrational's team, including Levine, had worked previously. \nBioShock received universal acclaim and was particularly praised by critics for its narrative, themes, visual design, setting, and gameplay. It is considered to be one of the greatest video games ever made and a demonstration of video games as an art form. Bioshock was followed by two sequels, BioShock 2 and BioShock Infinite, released in 2010 and 2013, respectively. Ports of Bioshock were released for macOS and mobile following its console releases. A remastered version of the game was released on Microsoft Windows, PlayStation 4, Xbox One, and Nintendo Switch as part of BioShock: The Collection."},{"rank":17,"name":"The Last of Us","slug":"the-last-of-us","beatInfo":{"main":15.5,"mainExtra":17.5,"completionist":22},"imageUrl":"/games/9997_The_Last_of_Us.jpg","summary":"The Last of Us is a 2013 action-adventure game developed by Naughty Dog and published by Sony Computer Entertainment. Players control Joel, a smuggler tasked with escorting a teenage girl, Ellie, across a post-apocalyptic United States. The Last of Us is played from a third-person perspective. Players use firearms and improvised weapons, and can use stealth to defend against hostile humans and cannibalistic creatures infected by a mutated fungus in the genus Cordyceps. In the online multiplayer mode, up to eight players engage in cooperative and competitive gameplay.\nDevelopment of The Last of Us began in 2009, soon after the release of Naughty Dog's previous game, Uncharted 2: Among Thieves. For the first time in the company's history, Naughty Dog split into two teams; while one team developed Uncharted 3: Drake's Deception, the other half developed The Last of Us. The relationship between Joel and Ellie became the focus, with all other elements developed around it. Actors Troy Baker and Ashley Johnson portrayed Joel and Ellie, respectively, through voice and motion capture, and assisted creative director Neil Druckmann with the development of the characters and story. The original score was composed and performed by Gustavo Santaolalla.\nFollowing its announcement in December 2011, The Last of Us was widely anticipated. It was released for the PlayStation 3 in June 2013. It received critical acclaim, with praise for its narrative, gameplay, visuals, sound design, score, characterization, and depiction of female characters. The Last of Us became one of the best-selling video games, selling over 1.3 million units in its first week and 17 million by April 2018. The game won year-end accolades, including multiple Game of the Year awards, from several gaming publications, critics, and game award ceremonies. It has been cited as one of the greatest video games ever made.\nNaughty Dog released several downloadable content additions; The Last of Us: Left Behind adds a single-player campaign following Ellie and her best friend Riley. A remastered version of the game, titled The Last of Us Remastered, was released for the PlayStation 4 in July 2014. The Last of Us Part II, a sequel, was released in June 2020. A remake of the game, titled The Last of Us Part I, is set to release in September 2022 for PlayStation 5, and later for Windows. A television adaptation is currently in production by HBO, written by Druckmann and Craig Mazin and starring Pedro Pascal as Joel and Bella Ramsey as Ellie."},{"rank":16,"name":"The Witcher 3: Wild Hunt","slug":"the-witcher-3-wild-hunt","beatInfo":{"main":51,"mainExtra":103,"completionist":173},"imageUrl":"/games/10270_The_Witcher_3_Wild_Hunt.jpg","summary":"The Witcher 3: Wild Hunt is an action role-playing video game developed by Polish developer CD Projekt Red, and first published in 2015. It is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third game in The Witcher video game series, played in an open world with a third-person perspective. The games are based on The Witcher series of fantasy novels written by Andrzej Sapkowski. \nThe game takes place in a fictional fantasy world based on Slavic mythology. Players control  Geralt of Rivia, a monster slayer for hire known as a Witcher, and search for his adopted daughter, who is on the run from the otherworldly Wild Hunt. Players battle the game's many dangers with weapons and magic, interact with non-player characters, and complete quests to acquire experience points and gold, which are used to increase Geralt's abilities and purchase equipment. The game's story has three possible endings, determined by the player's choices at key points in the narrative.\nDevelopment began in 2011 and lasted for three and a half years. Central and Northern European cultures formed the basis of the game's world. REDengine 3 enabled the developer to create a complex story without compromising the game's open world. The music was primarily composed by Marcin Przybyłowicz and performed by the Brandenburg State Orchestra.\nThe Witcher 3: Wild Hunt was released for Microsoft Windows, PlayStation 4, and Xbox One in May 2015, with a Nintendo Switch version released in October 2019, and PlayStation 5 and Xbox Series X/S versions planned for release in Q4 2022. The game received critical acclaim, with praise for its gameplay, narrative, world design, combat, and visuals, although it received minor criticism due to technical issues. It received numerous game of the year awards and has been cited as one of the best video games ever made. Two expansions were also released to critical acclaim: Hearts of Stone and Blood and Wine. A Game of the Year edition was released in August 2016, with the base game, expansions and all downloadable content. The game shipped over 40 million copies, making it one of the best selling video games of all time."},{"rank":15,"name":"Halo 2","slug":"halo-2","beatInfo":{"main":9,"mainExtra":11.5,"completionist":19.5},"imageUrl":"/games/Halo2-cover.png","summary":"Halo 2 is a 2004 first-person shooter game developed by Bungie and published by Microsoft Game Studios for the Xbox console. Halo 2 is the second installment in the Halo franchise and the sequel to 2001's critically acclaimed Halo: Combat Evolved. The game features new weapons, enemies, and vehicles, and shipped with online multiplayer via Microsoft's Xbox Live service. In Halo 2's story mode, the player assumes the roles of the human Master Chief and alien Arbiter in a 26th-century conflict between the United Nations Space Command, the genocidal Covenant, and the parasitic Flood.\nAfter the success of Halo: Combat Evolved, a sequel was expected and highly anticipated. Bungie found inspiration in plot points and gameplay elements that had been left out of their first game, including online multiplayer. A troubled development and time constraints forced cuts to the scope of the game, including the wholesale removal of a more ambitious multiplayer mode, and necessitated a cliffhanger ending to the game's campaign mode. Among Halo 2's marketing was an early alternate reality game called \"I Love Bees\" that involved players solving real-world puzzles. Bungie supported the game after release with new multiplayer maps and updates to address cheating and glitches. The game was followed by a sequel, Halo 3, in September 2007.\nHalo 2 was a commercial and critical success and is often listed as one of the greatest video games of all time. The game became the most popular title on Xbox Live, holding that rank until the release of Gears of War for the Xbox 360 nearly two years later. Halo 2 is the best-selling first-generation Xbox game, with more than  8 million copies sold worldwide. The game received critical acclaim, with the multiplayer lauded; in comparison, the campaign and its cliffhanger ending was divisive. The game's online component was highly influential and cemented many features as standard in future games and online services, including matchmaking, lobbies, and clans. Halo 2's marketing heralded the beginnings of video games as  blockbuster media. A port of the game for Windows Vista was released in 2007, followed by a high-definition remake as part of Halo: The Master Chief Collection in 2014."},{"rank":14,"name":"Castlevania: Symphony of the Night","slug":"castlevania-symphony-of-the-night","beatInfo":{"main":8.5,"mainExtra":11.5,"completionist":16},"imageUrl":"/games/250px-Castlevania_SOTN_PAL.jpg","summary":"Castlevania: Symphony of the Night is an action role-playing game developed and published by Konami for the PlayStation. It was directed and produced by Toru Hagihara, with Koji Igarashi acting as assistant director. It is a direct sequel to Castlevania: Rondo of Blood, taking place four years later. It features Dracula's dhampir son Alucard (returning from Castlevania III: Dracula's Curse) as the protagonist, rising from his slumber to explore Dracula's castle which resurfaced after Richter Belmont vanished. Its design marks a break from previous entries in the series, re-introducing the exploration, nonlinear level design, and role-playing elements first experimented with in Castlevania II: Simon's Quest.Symphony of the Night initially sold poorly. However, it gradually gained sales through word-of-mouth and became a sleeper hit, developing a cult following and selling over 700,000 units in the United States and Japan. The game garnered widespread acclaim, often cited by critics as one of the best video games of all time, praising its gameplay innovations, atmosphere, visuals and soundtrack. It is also considered a pioneer of the Metroidvania genre, inspiring numerous exploration-based action-adventure games. Symphony of the Night would have a lasting impact on the Castlevania series, with numerous subsequent mainline entries adopting its gameplay model."},{"rank":13,"name":"Hades","slug":"hades","beatInfo":{"main":22,"mainExtra":47,"completionist":96},"imageUrl":"/games/62941_Hades.jpg","summary":"Hades (; Greek: ᾍδης, translit. Háidēs; Ἅιδης, Háidēs), in the ancient Greek religion and myth, is the god of the dead and the king of the underworld, with which his name became synonymous. Hades was the eldest son of Cronus and Rhea, although this also made him the last son to be regurgitated by his father. He and his brothers, Zeus and Poseidon, defeated their father's generation of gods, the Titans, and claimed rulership over the cosmos. Hades received the underworld, Zeus the sky, and Poseidon the sea, with the solid earth, long the province of Gaia, available to all three concurrently. In artistic depictions, Hades is typically portrayed holding a bident and wearing his helm with Cerberus, the three-headed guard dog of the underworld, standing to his side.\nThe Etruscan god Aita and the Roman gods Dis Pater and Orcus were eventually taken as equivalent to Hades and merged into Pluto, a Latinization of Plouton (Greek: Πλούτων, translit. Ploútōn), itself a euphemistic title often given to Hades.\n\n"},{"rank":12,"name":"Grand Theft Auto V","slug":"grand-theft-auto-v","beatInfo":{"main":31.5,"mainExtra":48.5,"completionist":80},"imageUrl":"/games/4064_Grand_Theft_Auto_V.jpg","summary":"Grand Theft Auto V is a 2013 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh main entry in the Grand Theft Auto series, following 2008's Grand Theft Auto IV, and the fifteenth instalment overall. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three protagonists—retired bank robber Michael De Santa, street gangster Franklin Clinton, and drug dealer and gunrunner Trevor Philips—and their attempts to commit heists while under pressure from a corrupt government agency and powerful criminals. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles.\nThe game is played from either a third-person or first-person perspective, and its world is navigated on foot and by vehicle. Players control the three lead protagonists throughout single-player and switch among them, both during and outside missions. The story is centred on the heist sequences, and many missions involve shooting and driving gameplay. A \"wanted\" system governs the aggression of law enforcement response to players who commit crimes. Grand Theft Auto Online, the game's online multiplayer mode, lets up to 30 players engage in a variety of different cooperative and competitive game modes.\nThe game's development began around the time of Grand Theft Auto IV's release and was shared between many of Rockstar's studios worldwide. The development team drew influence from many of their previous projects such as Red Dead Redemption and Max Payne 3 and designed the game around three lead protagonists to innovate on the core structure of its predecessors. Much of the development work constituted the open world's creation, and several team members conducted field research around California to capture footage for the design team. The game's soundtrack features an original score composed by a team of producers who collaborated over several years. It was released in September 2013 for the PlayStation 3 and Xbox 360, in November 2014 for the PlayStation 4 and Xbox One, in April 2015 for Windows, and in March 2022 for the PlayStation 5 and Xbox Series X/S.\nExtensively marketed and widely anticipated, the game broke industry sales records and became the fastest-selling entertainment product in history, earning $800 million in its first day and $1 billion in its first three days. It received critical acclaim, with praise directed at its multiple protagonist design, open world, presentation and gameplay. However, it caused controversies related to its depiction of violence and women. Considered one of seventh and eighth generation console gaming's most significant titles and among the best video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is the second best-selling video game of all time with over 165 million copies shipped, and as of April 2018, one of the most financially successful entertainment products of all time, with about $6 billion in worldwide revenue."},{"rank":11,"name":"Super Mario Bros. 3","slug":"super-mario-bros-3","beatInfo":{"main":5,"mainExtra":6,"completionist":6},"imageUrl":"/games/250px-Super_Mario_Bros._3_coverart.png","summary":"Super Mario Bros. 3 is a platform game developed and published by Nintendo for the Nintendo Entertainment System (NES). It was released for home consoles in Japan on October 23, 1988, in North America on February 12, 1990 and in Europe on August 29, 1991. It was developed by Nintendo Entertainment Analysis and Development, led by Shigeru Miyamoto and Takashi Tezuka.\nPlayers control brothers Mario or Luigi, who must save Princess Toadstool and the rulers of seven different kingdoms from the antagonist Bowser. As in previous Mario games, they defeat enemies by stomping on them or using items that bestow magical powers; they also have new abilities, including flight and sliding down slopes. Super Mario Bros. 3 introduced many elements that became Super Mario staples, such as Bowser's children (the Koopalings) and a world map to transition between levels.\nSuper Mario Bros. 3 was praised by critics for its challenging gameplay and is listed as one of the greatest video games of all time. It is the third-best-selling NES game, with more than 17 million copies sold worldwide. It also inspired an animated television series, The Adventures of Super Mario Bros. 3, produced by DiC Entertainment.\nSuper Mario Bros. 3 was remade for the Super NES as a part of Super Mario All-Stars in 1993 and for the Game Boy Advance as Super Mario Advance 4: Super Mario Bros. 3 in 2003. It was rereleased on the Virtual Console service on the Wii U and 3DS, and was included on the NES Classic Mini. On September 19, 2018, it was rereleased on the Nintendo Switch Online service with added netplay."},{"rank":10,"name":"Disco Elysium","slug":"disco-elysium","beatInfo":{"main":22,"mainExtra":31.5,"completionist":44.5},"imageUrl":"/games/57335_Disco_Elysium.jpg","summary":"Disco Elysium is a 2019 role-playing video game developed and published by ZA/UM. Inspired by Infinity Engine–era games, particularly Planescape: Torment, the game was written and designed by Estonian novelist Robert Kurvitz and features a distinctive oil painting art style with music by the English band British Sea Power.\nDisco Elysium takes place in a large city still recovering from a war decades prior to the game's start, with players taking the role of an amnesiac detective who has been tasked with solving a murder mystery. During the investigation, he comes to recall events about his own past as well as current forces trying to affect the city. Disco Elysium was released for Windows in October 2019 and macOS in April 2020. An expanded version of the game featuring full voice acting and new content, subtitled The Final Cut, was released for consoles in 2021, alongside a free update for the PC versions.\nDisco Elysium is a non-traditional role-playing game featuring no combat. Instead, events are resolved through skill checks and dialogue trees via a system of 24 skills that represent different aspects of the protagonist, such as his perception and pain threshold. In addition, a system called the Thought Cabinet represents his other ideologies and personality traits, with players having the ability to freely support or suppress them. The game is based on a tabletop role-playing game setting that Kurvitz had previously created, with him forming ZA/UM in 2016 to work on the game. Disco Elysium won numerous awards for its narrative and art, while being named game of the year by several publications. A television series adaptation was announced in 2020."},{"rank":9,"name":"Half-Life 2","slug":"half-life-2","beatInfo":{"main":13,"mainExtra":15.5,"completionist":19.5},"imageUrl":"/games/256px-421px-HL2box.jpg","summary":"Half-Life 2 is a 2004 first-person shooter game developed by Valve. It was published by Valve through its distribution service Steam. Like the original Half-Life (1998), Half-Life 2 combines shooting, puzzles, and storytelling, and adds features such as vehicles and physics-based gameplay. Players control Gordon Freeman as he joins a resistance movement to liberate the Earth from the control of an alien empire, the Combine.\nHalf-Life 2 was created using Valve's Source engine, which was developed at the same time. Development lasted five years and cost US$40 million. Valve president Gabe Newell set his team the goal of redefining the first-person shooter genre. They integrated the Havok physics engine, which simulates real-world physics, to reinforce the player's sense of presence and create new gameplay, and developed the characterization, with more detailed character models and realistic animation.\nValve announced Half-Life 2 at E3 2003, with a release date for that September. It was delayed by over a year, triggering a backlash. A year before release, an unfinished version was stolen by a hacker and leaked online, which damaged team morale and slowed development.\nHalf-Life 2 was released on Steam on November 16, 2004, and received universal acclaim. It won 39 Game of the Year awards and has been cited as one of the best games ever made. By 2011, it had sold 12 million copies. Half-Life 2 was followed by the free extra level Lost Coast (2005) and the episodic sequels Episode One (2006) and Episode Two (2007). In 2020, after canceling Episode Three and several further Half-Life projects, Valve released the prequel Half-Life: Alyx."},{"rank":8,"name":"Red Dead Redemption 2","slug":"red-dead-redemption-2","beatInfo":{"main":50,"mainExtra":79.5,"completionist":174},"imageUrl":"/games/27100_Red_Dead_Redemption_2.jpg","summary":"Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. The story is set in 1899 and follows the exploits of outlaw Arthur Morgan, a member of the Van der Linde gang, in a fictionalized representation of the Western, Midwestern, and Southern United States. Arthur must deal with the decline of the Wild West whilst attempting to survive against government forces, rival gangs, and other adversaries. The game's epilogue follows fellow gang member John Marston, the protagonist of Red Dead Redemption.\nThe game is presented through both first and third-person perspectives, and the player may freely roam in its interactive open world. Gameplay elements include shootouts, heists, hunting, horseback riding, interacting with non-player characters, and maintaining the character's honor rating through moral choices and deeds. A bounty system similar to the \"wanted\" system from the Grand Theft Auto franchise governs the response of law enforcement and bounty hunters to crimes committed by the player. Red Dead Online, the game's online multiplayer mode, lets up to 32 players engage in a variety of cooperative and competitive game modes.\nThe game's development lasted over eight years, beginning soon after Red Dead Redemption's release, and it became one of the most expensive video games ever made. Rockstar co-opted all of its studios into one large team to facilitate development. They drew influence from real locations as opposed to film or art, focused on creating an accurate reflection of the time with the game's characters and world. The game was Rockstar's first built specifically for eighth generation consoles, having tested their technical capabilities while porting Grand Theft Auto V to the platforms. The game's soundtrack features an original score composed by Woody Jackson and several vocal tracks produced by Daniel Lanois. Red Dead Redemption 2 was released for the PlayStation 4 and Xbox One in October 2018, and for Windows and Stadia in November 2019.\nWidely anticipated and marketed before release, Red Dead Redemption 2 broke several records and had the second-biggest launch in the history of entertainment, generating US$725 million in sales from its opening weekend and exceeding the lifetime sales of Red Dead Redemption in two weeks. It received critical acclaim, with praise directed at its story, characters, open world, graphics, music, and level of detail; some criticism was directed at its control scheme and emphasis on realism over player freedom. Considered an example of video games as an art form as well as one of the greatest video games ever made, it won year-end accolades including Game of the Year awards from several gaming publications. It is also among the best-selling video games with over 44 million copies shipped."},{"rank":7,"name":"Super Mario 64","slug":"super-mario-64","beatInfo":{"main":12,"mainExtra":17.5,"completionist":20.5},"imageUrl":"/games/Super_Mario_64_box_cover.jpg","summary":"Super Mario 64 is a 1996 platform game for the Nintendo 64. Developed by Nintendo Entertainment Analysis and Development and published by Nintendo, it is the first Super Mario game to feature 3D gameplay, combining traditional Super Mario gameplay, visual style, and characters in a large open world. Bowser, one of the main antagonists of the Super Mario franchise, invades Princess Peach's castle and hides the castle's sources of protection, Power Stars, in many different worlds behind magical paintings. As Mario, the player collects Power Stars to unlock enough of Princess Peach's castle to get to Bowser and rescue Princess Peach.\nDirector Shigeru Miyamoto conceived a 3D Super Mario game during the production of Star Fox (1993). Development lasted nearly three years: about one year on design and twenty months on production, starting with designing the virtual camera system. The team continued with illustrating the 3D character models—at the time a relatively unattempted task—and refining sprite movements. The game's sound effects were recorded by Yoji Inagaki and the score was composed by Koji Kondo.\nSuper Mario 64 was highly anticipated by video game journalists and audiences, boosted by advertising campaigns and showings at the 1996 E3 trade show. It received critical acclaim and is considered one of the greatest video games of all time. Reviewers praised its ambition, visuals, and gameplay while some criticized its virtual camera system. It is the best-selling Nintendo 64 game, with nearly twelve million copies sold by 2015.\nNumerous developers have cited Super Mario 64 as an influence on 3D platform games, with its dynamic camera system and 360-degree analog control establishing a new archetype for the genre, much as Super Mario Bros. did for side-scrolling platform games. It was remade as Super Mario 64 DS for the Nintendo DS in 2004, and has been ported to other Nintendo consoles since. The game has attracted a cult following, spawning many fangames, a large speedrunning presence, and enduring rumors surrounding game features."},{"rank":6,"name":"Mass Effect 2","slug":"mass-effect-2","beatInfo":{"main":24.5,"mainExtra":35.5,"completionist":50},"imageUrl":"/games/MassEffect2_cover.PNG","summary":"Mass Effect 2 is an action role-playing video game developed by BioWare and published by Electronic Arts for Microsoft Windows and Xbox 360 in 2010, and for PlayStation 3 in 2011. It is the second installment in the Mass Effect series and a sequel to the original Mass Effect. The game takes place within the Milky Way galaxy during the 22nd century, where humanity is threatened by an insectoid alien race known as the Collectors. The player assumes the role of Commander Shepard, an elite human soldier who must assemble and gain the loyalty of a diverse team to stop the Collectors in a suicide mission. With the use of a completed saved game of its predecessor, the player can impact the story of the game in numerous ways.\nFor the game, BioWare changed several gameplay elements and put further emphasis on third-person shooter aspects, including limited ammunition and regenerable health. In contrast to the exclusive focus on the main story of the original Mass Effect, the developers opted to create a plot where optional missions had as much intensity as the main mission. Mass Effect composer Jack Wall returned to compose Mass Effect 2's music, aiming for a darker and more mature sound to match the mood of the game. Mass Effect 2 also supports a variety of downloadable content packs, ranging from single in-game character outfits to entirely new plot-related missions. Notable packs include Kasumi – Stolen Memory, Overlord, Lair of the Shadow Broker, and Arrival.\nReleased to critical acclaim, Mass Effect 2 was praised for its presentation and cinematography, diverse and complex characters, and improved combat over its predecessor. Some critics, however, expressed concerns about the game's simplified role-playing mechanics. The game received numerous year-end awards, including Game of the Year at the 14th Annual Interactive Achievement Awards, and Best Game at the 2011 British Academy of Film and Television Arts Awards. Retrospectively, Mass Effect 2 is considered a significant improvement over its predecessor and one of the greatest video games of all time. A sequel, Mass Effect 3, was released in 2012. In 2021, Mass Effect 2 was remastered as part of the Mass Effect Legendary Edition."},{"rank":5,"name":"Super Metroid","slug":"super-metroid","beatInfo":{"main":7.5,"mainExtra":8.5,"completionist":9},"imageUrl":"/games/250px-Smetroidbox.jpg","summary":"Super Metroid is an action-adventure game developed and published by Nintendo for the Super Nintendo Entertainment System in 1994. It is the third installment in the Metroid series, following the events of the Game Boy game Metroid II: Return of Samus (1991). Players control bounty hunter Samus Aran, who travels to planet Zebes to retrieve an infant Metroid creature stolen by the Space Pirate leader Ridley.\nFollowing the established gameplay model of its predecessors, Super Metroid focuses on exploration, with the player searching for power-ups used to reach previously inaccessible areas. It introduced new concepts to the series, such as the inventory screen, an automap, and the ability to fire in all directions. The development staff from previous Metroid games—including Yoshio Sakamoto, Makoto Kano and Gunpei Yokoi—returned to develop Super Metroid over the course of two years. The developers wanted to make a true action game, and set the stage for Samus's reappearance.\nSuper Metroid received acclaim, with praise for its atmosphere, gameplay, music and graphics. It is often cited as one of the best video games of all time. The game sold well and shipped 1.42 million copies worldwide by late 2003. Alongside Castlevania: Symphony of the Night, Super Metroid is credited for establishing the \"Metroidvania\" genre, inspiring numerous indie games and developers. It also became popular among players for speedrunning. Super Metroid was followed in 2002 by Metroid Fusion and Metroid Prime. It has been rereleased on several Nintendo consoles and services.\n\n"},{"rank":4,"name":"The Legend of Zelda: A Link to the Past","slug":"the-legend-of-zelda-a-link-to-the-past","beatInfo":{"main":15,"mainExtra":17,"completionist":17.5},"imageUrl":"/games/250px-Zelda_SNES.jpg","summary":"The Legend of Zelda: A Link to the Past is an Action Adventure developed and published by Nintendo for the Super Nintendo Entertainment System. It is the third game in The Legend of Zelda series and was released in 1991 in Japan and 1992 in North America and Europe.\nThe story is set many years before the events of the first two Zelda games. The player assumes the role of Link as he journeys to save Hyrule, defeat the demon king Ganon, and rescue the descendants of the Seven Sages. It returns to a top-down perspective similar to the original The Legend of Zelda, dropping the side-scrolling gameplay of Zelda II: The Adventure of Link. It introduced series staples such as parallel worlds and items including the Master Sword.\nReleased to critical and commercial success, A Link to the Past was a landmark game for Nintendo and is considered one of the greatest video games of all time. It was ported to the Game Boy Advance as A Link to the Past and Four Swords in 2002; A Link to the Past sold 6.5 million copies across both platforms as of 2004. It was subsequently ported for the Wii, Wii U, and New Nintendo 3DS via the Virtual Console, and Nintendo Switch via Nintendo Switch Online. In 2017, Nintendo rereleased A Link to the Past as part of the Super NES Classic Edition. A spiritual successor, The Legend of Zelda: A Link Between Worlds, was announced and released for the Nintendo 3DS in 2013.\n\n"},{"rank":3,"name":"Portal 2","slug":"portal-2","beatInfo":{"main":8.5,"mainExtra":13.5,"completionist":21},"imageUrl":"/games/Portal2cover.jpg","summary":"Portal 2 is a 2011 puzzle-platform video game developed by Valve for Windows, Mac OS X, Linux, PlayStation 3, and Xbox 360. The digital PC version is distributed online by Valve's Steam service, while all retail editions were distributed by Electronic Arts. A port for the Nintendo Switch was included as part of Portal: Companion Collection.\nLike the original Portal (2007), players solve puzzles by placing portals and teleporting between them. Portal 2 adds features including tractor beams, lasers, light bridges, and paint-like gels that alter player movement or allow portals to be placed on any surface. In the single-player campaign, players control Chell, who navigates the dilapidated Aperture Science Enrichment Center during its reconstruction by the supercomputer GLaDOS (Ellen McLain); new characters include robot Wheatley (Stephen Merchant) and Aperture founder Cave Johnson (J. K. Simmons). In the new cooperative mode, players solve puzzles together as robots Atlas and P-Body (both voiced by Dee Bradley Baker). Jonathan Coulton and the National produced songs for the game.\nValve announced Portal 2 in March 2010, and promoted it with alternate reality games including the Potato Sack, a collaboration with several independent game developers. After release, Valve released downloadable content and a simplified map editor to allow players to create and share levels.\nPortal 2 received critical acclaim for its gameplay, balanced learning curve, pacing, dark humor, writing, and acting. Like its predecessor, it has been described as one of the greatest video games ever made by numerous publications and critics."},{"rank":2,"name":"Super Mario World","slug":"super-mario-world","beatInfo":{"main":5,"mainExtra":7.5,"completionist":10},"imageUrl":"/games/250px-Super_Mario_World_Coverart.png","summary":"Super Mario World is a 1990 platform game developed by Nintendo for the Super Nintendo Entertainment System (SNES). The story follows Mario's quest to save Princess Toadstool and Dinosaur Land from the series' antagonist Bowser and his minions, the Koopalings. The gameplay is similar to that of earlier Super Mario games: players control Mario or his brother Luigi through a series of levels in which the goal is to reach the goalpost at the end. Super Mario World introduced Yoshi, a dinosaur who can eat enemies, as well as gain abilities by eating the shells of Koopa Troopas.\nNintendo Entertainment Analysis & Development developed the game, led by director Takashi Tezuka and producer and series creator Shigeru Miyamoto. It is the first Mario game for the SNES and was designed to make the most of the console's technical features. The development team had more freedom compared to the series installments for the Nintendo Entertainment System (NES). Yoshi was conceptualised during the development of the NES games but was not used until Super Mario World due to hardware limitations.\nSuper Mario World is often considered one of the best games in the series and has been cited as one of the greatest video games ever made. It sold more than twenty million copies worldwide, making it the best-selling SNES game. It also led to an animated television series of the same name. It has been rereleased on multiple occasions: It was part of the 1994 compilation Super Mario All-Stars + Super Mario World for the SNES and was rereleased for the Game Boy Advance as Super Mario World: Super Mario Advance 2 in 2001, on the Virtual Console for the Wii, Wii U, and New Nintendo 3DS consoles, and as part of the Super NES Classic Edition. On 3 March 2016, it was released for the New Nintendo 3DS XL. Since 5 September 2019 in North America, and in Japan, Europe, Australia, Hong Kong, and South Korea on September 6, the game has been playable on the Nintendo Switch through the Super Nintendo Entertainment System app."},{"rank":1,"name":"The Legend of Zelda: Breath of the Wild","slug":"the-legend-of-zelda-breath-of-the-wild","beatInfo":{"main":50,"mainExtra":97.5,"completionist":189},"imageUrl":"/games/38019_The_Legend_of_Zelda_Breath_of_the_Wild.jpg","summary":"The Legend of Zelda: Breath of the Wild is a 2017 action-adventure game developed and published by Nintendo for the Nintendo Switch and Wii U consoles. The game is an installment of The Legend of Zelda series and is set at the end of its timeline. The player controls an amnesiac Link, who awakens from a hundred-year slumber, and attempts to regain his memories and prevent the destruction of Hyrule by Calamity Ganon.\nSimilar to the original 1986 The Legend of Zelda game, players are given little instruction and can explore the open world freely. Tasks include collecting various items and gear to aid in objectives such as puzzle-solving or side quests. The world is unstructured and designed to encourage exploration and experimentation, and the main story quest can be completed in a nonlinear fashion.\nDevelopment of Breath of the Wild took place over five years, following the responses from some fans who wanted a larger game world to explore. Wanting to rethink the conventions of the series, Nintendo introduced elements such as detailed chemistry and physics engines. Monolith Soft, known for their work on the open world Xenoblade Chronicles series, assisted in designing landscapes and topography. The game was originally planned for release in 2015 as a Wii U exclusive but was delayed twice. Released on March 3, 2017, Breath of the Wild was a launch game for the Nintendo Switch and the final Nintendo-published game for the Wii U. Two waves of downloadable content were released in 2017 via an expansion pass.\nBreath of the Wild received universal acclaim for its open-ended gameplay and attention to detail. Critics called it a landmark in open world game design, although it received minor criticism for its technical performance at launch. It won several game of the year awards and has since been cited as one of the greatest video games of all time. Breath of the Wild is also one of the best-selling video games of all time, selling over 28 million copies by 2022. A spin-off, Hyrule Warriors: Age of Calamity, was released in 2020. A sequel is set for release on the Switch in 2023."}]